/* automatically generated by rust-bindgen 0.72.1 */

pub const _TIME_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC2Y: u32 = 0;
pub const __GLIBC_USE_ISOC23: u32 = 0;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __WORDSIZE_TIME64_COMPAT32: u32 = 1;
pub const __SYSCALL_WORDSIZE: u32 = 64;
pub const __TIMESIZE: u32 = 64;
pub const __USE_TIME_BITS64: u32 = 1;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_SCANF: u32 = 0;
pub const __GLIBC_USE_C23_STRTOL: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_60559_BFP__: u32 = 201404;
pub const __STDC_IEC_559_COMPLEX__: u32 = 1;
pub const __STDC_IEC_60559_COMPLEX__: u32 = 201404;
pub const __STDC_ISO_10646__: u32 = 201706;
pub const __GNU_LIBRARY__: u32 = 6;
pub const __GLIBC__: u32 = 2;
pub const __GLIBC_MINOR__: u32 = 41;

pub const MY_CS_NAME_SIZE: u32 = 32;
pub const MADB_DEFAULT_CHARSET_NAME: &[u8; 7] = b"latin1\0";
pub const MADB_DEFAULT_COLLATION_NAME: &[u8; 18] = b"latin1_swedish_ci\0";
pub const MADB_AUTODETECT_CHARSET_NAME: &[u8; 5] = b"auto\0";
pub const AUTO_SEC_PART_DIGITS: u32 = 39;
pub const SEC_PART_DIGITS: u32 = 6;
pub const MARIADB_INVALID_SOCKET: i32 = -1;
pub const MYSQL_WAIT_READ: u32 = 1;
pub const MYSQL_WAIT_WRITE: u32 = 2;
pub const MYSQL_WAIT_EXCEPT: u32 = 4;
pub const MYSQL_WAIT_TIMEOUT: u32 = 8;
pub const MARIADB_TLS_VERIFY_OK: u32 = 0;
pub const MARIADB_TLS_VERIFY_TRUST: u32 = 1;
pub const MARIADB_TLS_VERIFY_HOST: u32 = 2;
pub const MARIADB_TLS_VERIFY_FINGERPRINT: u32 = 4;
pub const MARIADB_TLS_VERIFY_PERIOD: u32 = 8;
pub const MARIADB_TLS_VERIFY_REVOKED: u32 = 16;
pub const MARIADB_TLS_VERIFY_UNKNOWN: u32 = 32;
pub const MARIADB_TLS_VERIFY_ERROR: u32 = 128;
pub const LOCAL_INFILE_ERROR_LEN: u32 = 512;
pub const MYSQL_NO_DATA: u32 = 100;
pub const MYSQL_DATA_TRUNCATED: u32 = 101;
pub const MADB_BIND_DUMMY: u32 = 1;
pub const MYSQL_PS_SKIP_RESULT_W_LEN: i32 = -1;
pub const MYSQL_PS_SKIP_RESULT_STR: i32 = -2;
pub const STMT_ID_LENGTH: u32 = 4;
pub const STMT_BULK_FLAG_CLIENT_SEND_TYPES: u32 = 128;
pub const STMT_BULK_FLAG_SEND_UNIT_RESULTS: u32 = 64;
pub type __gnuc_va_list = __builtin_va_list;
pub type va_list = __builtin_va_list;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __fsid_t"][::std::mem::size_of::<__fsid_t>() - 8usize];
    ["Alignment of __fsid_t"][::std::mem::align_of::<__fsid_t>() - 4usize];
    ["Offset of field: __fsid_t::__val"][::std::mem::offset_of!(__fsid_t, __val) - 0usize];
};
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type clock_t = __clock_t;
pub type time_t = __time_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm {
    pub tm_sec: ::std::os::raw::c_int,
    pub tm_min: ::std::os::raw::c_int,
    pub tm_hour: ::std::os::raw::c_int,
    pub tm_mday: ::std::os::raw::c_int,
    pub tm_mon: ::std::os::raw::c_int,
    pub tm_year: ::std::os::raw::c_int,
    pub tm_wday: ::std::os::raw::c_int,
    pub tm_yday: ::std::os::raw::c_int,
    pub tm_isdst: ::std::os::raw::c_int,
    pub tm_gmtoff: ::std::os::raw::c_long,
    pub tm_zone: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of tm"][::std::mem::size_of::<tm>() - 56usize];
    ["Alignment of tm"][::std::mem::align_of::<tm>() - 8usize];
    ["Offset of field: tm::tm_sec"][::std::mem::offset_of!(tm, tm_sec) - 0usize];
    ["Offset of field: tm::tm_min"][::std::mem::offset_of!(tm, tm_min) - 4usize];
    ["Offset of field: tm::tm_hour"][::std::mem::offset_of!(tm, tm_hour) - 8usize];
    ["Offset of field: tm::tm_mday"][::std::mem::offset_of!(tm, tm_mday) - 12usize];
    ["Offset of field: tm::tm_mon"][::std::mem::offset_of!(tm, tm_mon) - 16usize];
    ["Offset of field: tm::tm_year"][::std::mem::offset_of!(tm, tm_year) - 20usize];
    ["Offset of field: tm::tm_wday"][::std::mem::offset_of!(tm, tm_wday) - 24usize];
    ["Offset of field: tm::tm_yday"][::std::mem::offset_of!(tm, tm_yday) - 28usize];
    ["Offset of field: tm::tm_isdst"][::std::mem::offset_of!(tm, tm_isdst) - 32usize];
    ["Offset of field: tm::tm_gmtoff"][::std::mem::offset_of!(tm, tm_gmtoff) - 40usize];
    ["Offset of field: tm::tm_zone"][::std::mem::offset_of!(tm, tm_zone) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timespec"][::std::mem::size_of::<timespec>() - 16usize];
    ["Alignment of timespec"][::std::mem::align_of::<timespec>() - 8usize];
    ["Offset of field: timespec::tv_sec"][::std::mem::offset_of!(timespec, tv_sec) - 0usize];
    ["Offset of field: timespec::tv_nsec"][::std::mem::offset_of!(timespec, tv_nsec) - 8usize];
};
pub type clockid_t = __clockid_t;
pub type timer_t = __timer_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct itimerspec {
    pub it_interval: timespec,
    pub it_value: timespec,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of itimerspec"][::std::mem::size_of::<itimerspec>() - 32usize];
    ["Alignment of itimerspec"][::std::mem::align_of::<itimerspec>() - 8usize];
    ["Offset of field: itimerspec::it_interval"]
        [::std::mem::offset_of!(itimerspec, it_interval) - 0usize];
    ["Offset of field: itimerspec::it_value"]
        [::std::mem::offset_of!(itimerspec, it_value) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sigevent {
    _unused: [u8; 0],
}
pub type pid_t = __pid_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ::std::os::raw::c_ushort,
    pub __ctype_tolower: *const ::std::os::raw::c_int,
    pub __ctype_toupper: *const ::std::os::raw::c_int,
    pub __names: [*const ::std::os::raw::c_char; 13usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __locale_struct"][::std::mem::size_of::<__locale_struct>() - 232usize];
    ["Alignment of __locale_struct"][::std::mem::align_of::<__locale_struct>() - 8usize];
    ["Offset of field: __locale_struct::__locales"]
        [::std::mem::offset_of!(__locale_struct, __locales) - 0usize];
    ["Offset of field: __locale_struct::__ctype_b"]
        [::std::mem::offset_of!(__locale_struct, __ctype_b) - 104usize];
    ["Offset of field: __locale_struct::__ctype_tolower"]
        [::std::mem::offset_of!(__locale_struct, __ctype_tolower) - 112usize];
    ["Offset of field: __locale_struct::__ctype_toupper"]
        [::std::mem::offset_of!(__locale_struct, __ctype_toupper) - 120usize];
    ["Offset of field: __locale_struct::__names"]
        [::std::mem::offset_of!(__locale_struct, __names) - 128usize];
};
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
unsafe extern "C" {
    pub fn clock() -> clock_t;
}
unsafe extern "C" {
    pub fn time(__timer: *mut time_t) -> time_t;
}
unsafe extern "C" {
    pub fn difftime(__time1: time_t, __time0: time_t) -> f64;
}
unsafe extern "C" {
    pub fn mktime(__tp: *mut tm) -> time_t;
}
unsafe extern "C" {
    pub fn strftime(
        __s: *mut ::std::os::raw::c_char,
        __maxsize: usize,
        __format: *const ::std::os::raw::c_char,
        __tp: *const tm,
    ) -> usize;
}
unsafe extern "C" {
    pub fn strftime_l(
        __s: *mut ::std::os::raw::c_char,
        __maxsize: usize,
        __format: *const ::std::os::raw::c_char,
        __tp: *const tm,
        __loc: locale_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn gmtime(__timer: *const time_t) -> *mut tm;
}
unsafe extern "C" {
    pub fn localtime(__timer: *const time_t) -> *mut tm;
}
unsafe extern "C" {
    pub fn gmtime_r(__timer: *const time_t, __tp: *mut tm) -> *mut tm;
}
unsafe extern "C" {
    pub fn localtime_r(__timer: *const time_t, __tp: *mut tm) -> *mut tm;
}
unsafe extern "C" {
    pub fn asctime(__tp: *const tm) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ctime(__timer: *const time_t) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn asctime_r(
        __tp: *const tm,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ctime_r(
        __timer: *const time_t,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub static mut __tzname: [*mut ::std::os::raw::c_char; 2usize];
}
unsafe extern "C" {
    pub static mut __daylight: ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static mut __timezone: ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub static mut tzname: [*mut ::std::os::raw::c_char; 2usize];
}
unsafe extern "C" {
    pub fn tzset();
}
unsafe extern "C" {
    pub static mut daylight: ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static mut timezone: ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn timegm(__tp: *mut tm) -> time_t;
}
unsafe extern "C" {
    pub fn timelocal(__tp: *mut tm) -> time_t;
}
unsafe extern "C" {
    pub fn dysize(__year: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nanosleep(
        __requested_time: *const timespec,
        __remaining: *mut timespec,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clock_getres(__clock_id: clockid_t, __res: *mut timespec) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clock_gettime(__clock_id: clockid_t, __tp: *mut timespec) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clock_settime(__clock_id: clockid_t, __tp: *const timespec) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clock_nanosleep(
        __clock_id: clockid_t,
        __flags: ::std::os::raw::c_int,
        __req: *const timespec,
        __rem: *mut timespec,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clock_getcpuclockid(__pid: pid_t, __clock_id: *mut clockid_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timer_create(
        __clock_id: clockid_t,
        __evp: *mut sigevent,
        __timerid: *mut timer_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timer_delete(__timerid: timer_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timer_settime(
        __timerid: timer_t,
        __flags: ::std::os::raw::c_int,
        __value: *const itimerspec,
        __ovalue: *mut itimerspec,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timer_gettime(__timerid: timer_t, __value: *mut itimerspec) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timer_getoverrun(__timerid: timer_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timespec_get(
        __ts: *mut timespec,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type off_t = __off_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sigset_t"][::std::mem::size_of::<__sigset_t>() - 128usize];
    ["Alignment of __sigset_t"][::std::mem::align_of::<__sigset_t>() - 8usize];
    ["Offset of field: __sigset_t::__val"][::std::mem::offset_of!(__sigset_t, __val) - 0usize];
};
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timeval"][::std::mem::size_of::<timeval>() - 16usize];
    ["Alignment of timeval"][::std::mem::align_of::<timeval>() - 8usize];
    ["Offset of field: timeval::tv_sec"][::std::mem::offset_of!(timeval, tv_sec) - 0usize];
    ["Offset of field: timeval::tv_usec"][::std::mem::offset_of!(timeval, tv_usec) - 8usize];
};
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fd_set"][::std::mem::size_of::<fd_set>() - 128usize];
    ["Alignment of fd_set"][::std::mem::align_of::<fd_set>() - 8usize];
    ["Offset of field: fd_set::__fds_bits"][::std::mem::offset_of!(fd_set, __fds_bits) - 0usize];
};
pub type fd_mask = __fd_mask;
unsafe extern "C" {
    pub fn select(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pselect(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> ::std::os::raw::c_int;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __atomic_wide_counter {
    pub __value64: ::std::os::raw::c_ulonglong,
    pub __value32: __atomic_wide_counter__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __atomic_wide_counter__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __atomic_wide_counter__bindgen_ty_1"]
        [::std::mem::size_of::<__atomic_wide_counter__bindgen_ty_1>() - 8usize];
    ["Alignment of __atomic_wide_counter__bindgen_ty_1"]
        [::std::mem::align_of::<__atomic_wide_counter__bindgen_ty_1>() - 4usize];
    ["Offset of field: __atomic_wide_counter__bindgen_ty_1::__low"]
        [::std::mem::offset_of!(__atomic_wide_counter__bindgen_ty_1, __low) - 0usize];
    ["Offset of field: __atomic_wide_counter__bindgen_ty_1::__high"]
        [::std::mem::offset_of!(__atomic_wide_counter__bindgen_ty_1, __high) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __atomic_wide_counter"][::std::mem::size_of::<__atomic_wide_counter>() - 8usize];
    ["Alignment of __atomic_wide_counter"]
        [::std::mem::align_of::<__atomic_wide_counter>() - 8usize];
    ["Offset of field: __atomic_wide_counter::__value64"]
        [::std::mem::offset_of!(__atomic_wide_counter, __value64) - 0usize];
    ["Offset of field: __atomic_wide_counter::__value32"]
        [::std::mem::offset_of!(__atomic_wide_counter, __value32) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_internal_list"][::std::mem::size_of::<__pthread_internal_list>() - 16usize];
    ["Alignment of __pthread_internal_list"]
        [::std::mem::align_of::<__pthread_internal_list>() - 8usize];
    ["Offset of field: __pthread_internal_list::__prev"]
        [::std::mem::offset_of!(__pthread_internal_list, __prev) - 0usize];
    ["Offset of field: __pthread_internal_list::__next"]
        [::std::mem::offset_of!(__pthread_internal_list, __next) - 8usize];
};
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_slist {
    pub __next: *mut __pthread_internal_slist,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_internal_slist"]
        [::std::mem::size_of::<__pthread_internal_slist>() - 8usize];
    ["Alignment of __pthread_internal_slist"]
        [::std::mem::align_of::<__pthread_internal_slist>() - 8usize];
    ["Offset of field: __pthread_internal_slist::__next"]
        [::std::mem::offset_of!(__pthread_internal_slist, __next) - 0usize];
};
pub type __pthread_slist_t = __pthread_internal_slist;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_mutex_s"][::std::mem::size_of::<__pthread_mutex_s>() - 40usize];
    ["Alignment of __pthread_mutex_s"][::std::mem::align_of::<__pthread_mutex_s>() - 8usize];
    ["Offset of field: __pthread_mutex_s::__lock"]
        [::std::mem::offset_of!(__pthread_mutex_s, __lock) - 0usize];
    ["Offset of field: __pthread_mutex_s::__count"]
        [::std::mem::offset_of!(__pthread_mutex_s, __count) - 4usize];
    ["Offset of field: __pthread_mutex_s::__owner"]
        [::std::mem::offset_of!(__pthread_mutex_s, __owner) - 8usize];
    ["Offset of field: __pthread_mutex_s::__nusers"]
        [::std::mem::offset_of!(__pthread_mutex_s, __nusers) - 12usize];
    ["Offset of field: __pthread_mutex_s::__kind"]
        [::std::mem::offset_of!(__pthread_mutex_s, __kind) - 16usize];
    ["Offset of field: __pthread_mutex_s::__spins"]
        [::std::mem::offset_of!(__pthread_mutex_s, __spins) - 20usize];
    ["Offset of field: __pthread_mutex_s::__elision"]
        [::std::mem::offset_of!(__pthread_mutex_s, __elision) - 22usize];
    ["Offset of field: __pthread_mutex_s::__list"]
        [::std::mem::offset_of!(__pthread_mutex_s, __list) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: ::std::os::raw::c_uint,
    pub __writers: ::std::os::raw::c_uint,
    pub __wrphase_futex: ::std::os::raw::c_uint,
    pub __writers_futex: ::std::os::raw::c_uint,
    pub __pad3: ::std::os::raw::c_uint,
    pub __pad4: ::std::os::raw::c_uint,
    pub __cur_writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __rwelision: ::std::os::raw::c_schar,
    pub __pad1: [::std::os::raw::c_uchar; 7usize],
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_rwlock_arch_t"][::std::mem::size_of::<__pthread_rwlock_arch_t>() - 56usize];
    ["Alignment of __pthread_rwlock_arch_t"]
        [::std::mem::align_of::<__pthread_rwlock_arch_t>() - 8usize];
    ["Offset of field: __pthread_rwlock_arch_t::__readers"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __readers) - 0usize];
    ["Offset of field: __pthread_rwlock_arch_t::__writers"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __writers) - 4usize];
    ["Offset of field: __pthread_rwlock_arch_t::__wrphase_futex"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __wrphase_futex) - 8usize];
    ["Offset of field: __pthread_rwlock_arch_t::__writers_futex"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __writers_futex) - 12usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad3"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad3) - 16usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad4"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad4) - 20usize];
    ["Offset of field: __pthread_rwlock_arch_t::__cur_writer"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __cur_writer) - 24usize];
    ["Offset of field: __pthread_rwlock_arch_t::__shared"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __shared) - 28usize];
    ["Offset of field: __pthread_rwlock_arch_t::__rwelision"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __rwelision) - 32usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad1"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad1) - 33usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad2"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad2) - 40usize];
    ["Offset of field: __pthread_rwlock_arch_t::__flags"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __flags) - 48usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __wseq: __atomic_wide_counter,
    pub __g1_start: __atomic_wide_counter,
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
    pub __unused_initialized_1: ::std::os::raw::c_uint,
    pub __unused_initialized_2: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_cond_s"][::std::mem::size_of::<__pthread_cond_s>() - 48usize];
    ["Alignment of __pthread_cond_s"][::std::mem::align_of::<__pthread_cond_s>() - 8usize];
    ["Offset of field: __pthread_cond_s::__wseq"]
        [::std::mem::offset_of!(__pthread_cond_s, __wseq) - 0usize];
    ["Offset of field: __pthread_cond_s::__g1_start"]
        [::std::mem::offset_of!(__pthread_cond_s, __g1_start) - 8usize];
    ["Offset of field: __pthread_cond_s::__g_size"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_size) - 16usize];
    ["Offset of field: __pthread_cond_s::__g1_orig_size"]
        [::std::mem::offset_of!(__pthread_cond_s, __g1_orig_size) - 24usize];
    ["Offset of field: __pthread_cond_s::__wrefs"]
        [::std::mem::offset_of!(__pthread_cond_s, __wrefs) - 28usize];
    ["Offset of field: __pthread_cond_s::__g_signals"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_signals) - 32usize];
    ["Offset of field: __pthread_cond_s::__unused_initialized_1"]
        [::std::mem::offset_of!(__pthread_cond_s, __unused_initialized_1) - 40usize];
    ["Offset of field: __pthread_cond_s::__unused_initialized_2"]
        [::std::mem::offset_of!(__pthread_cond_s, __unused_initialized_2) - 44usize];
};
pub type __tss_t = ::std::os::raw::c_uint;
pub type __thrd_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __once_flag {
    pub __data: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __once_flag"][::std::mem::size_of::<__once_flag>() - 4usize];
    ["Alignment of __once_flag"][::std::mem::align_of::<__once_flag>() - 4usize];
    ["Offset of field: __once_flag::__data"][::std::mem::offset_of!(__once_flag, __data) - 0usize];
};
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_mutexattr_t"][::std::mem::size_of::<pthread_mutexattr_t>() - 4usize];
    ["Alignment of pthread_mutexattr_t"][::std::mem::align_of::<pthread_mutexattr_t>() - 4usize];
    ["Offset of field: pthread_mutexattr_t::__size"]
        [::std::mem::offset_of!(pthread_mutexattr_t, __size) - 0usize];
    ["Offset of field: pthread_mutexattr_t::__align"]
        [::std::mem::offset_of!(pthread_mutexattr_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_condattr_t"][::std::mem::size_of::<pthread_condattr_t>() - 4usize];
    ["Alignment of pthread_condattr_t"][::std::mem::align_of::<pthread_condattr_t>() - 4usize];
    ["Offset of field: pthread_condattr_t::__size"]
        [::std::mem::offset_of!(pthread_condattr_t, __size) - 0usize];
    ["Offset of field: pthread_condattr_t::__align"]
        [::std::mem::offset_of!(pthread_condattr_t, __align) - 0usize];
};
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_attr_t"][::std::mem::size_of::<pthread_attr_t>() - 56usize];
    ["Alignment of pthread_attr_t"][::std::mem::align_of::<pthread_attr_t>() - 8usize];
    ["Offset of field: pthread_attr_t::__size"]
        [::std::mem::offset_of!(pthread_attr_t, __size) - 0usize];
    ["Offset of field: pthread_attr_t::__align"]
        [::std::mem::offset_of!(pthread_attr_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 40usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_mutex_t"][::std::mem::size_of::<pthread_mutex_t>() - 40usize];
    ["Alignment of pthread_mutex_t"][::std::mem::align_of::<pthread_mutex_t>() - 8usize];
    ["Offset of field: pthread_mutex_t::__data"]
        [::std::mem::offset_of!(pthread_mutex_t, __data) - 0usize];
    ["Offset of field: pthread_mutex_t::__size"]
        [::std::mem::offset_of!(pthread_mutex_t, __size) - 0usize];
    ["Offset of field: pthread_mutex_t::__align"]
        [::std::mem::offset_of!(pthread_mutex_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_cond_t"][::std::mem::size_of::<pthread_cond_t>() - 48usize];
    ["Alignment of pthread_cond_t"][::std::mem::align_of::<pthread_cond_t>() - 8usize];
    ["Offset of field: pthread_cond_t::__data"]
        [::std::mem::offset_of!(pthread_cond_t, __data) - 0usize];
    ["Offset of field: pthread_cond_t::__size"]
        [::std::mem::offset_of!(pthread_cond_t, __size) - 0usize];
    ["Offset of field: pthread_cond_t::__align"]
        [::std::mem::offset_of!(pthread_cond_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_rwlock_t"][::std::mem::size_of::<pthread_rwlock_t>() - 56usize];
    ["Alignment of pthread_rwlock_t"][::std::mem::align_of::<pthread_rwlock_t>() - 8usize];
    ["Offset of field: pthread_rwlock_t::__data"]
        [::std::mem::offset_of!(pthread_rwlock_t, __data) - 0usize];
    ["Offset of field: pthread_rwlock_t::__size"]
        [::std::mem::offset_of!(pthread_rwlock_t, __size) - 0usize];
    ["Offset of field: pthread_rwlock_t::__align"]
        [::std::mem::offset_of!(pthread_rwlock_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_rwlockattr_t"][::std::mem::size_of::<pthread_rwlockattr_t>() - 8usize];
    ["Alignment of pthread_rwlockattr_t"][::std::mem::align_of::<pthread_rwlockattr_t>() - 8usize];
    ["Offset of field: pthread_rwlockattr_t::__size"]
        [::std::mem::offset_of!(pthread_rwlockattr_t, __size) - 0usize];
    ["Offset of field: pthread_rwlockattr_t::__align"]
        [::std::mem::offset_of!(pthread_rwlockattr_t, __align) - 0usize];
};
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_barrier_t"][::std::mem::size_of::<pthread_barrier_t>() - 32usize];
    ["Alignment of pthread_barrier_t"][::std::mem::align_of::<pthread_barrier_t>() - 8usize];
    ["Offset of field: pthread_barrier_t::__size"]
        [::std::mem::offset_of!(pthread_barrier_t, __size) - 0usize];
    ["Offset of field: pthread_barrier_t::__align"]
        [::std::mem::offset_of!(pthread_barrier_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_barrierattr_t"][::std::mem::size_of::<pthread_barrierattr_t>() - 4usize];
    ["Alignment of pthread_barrierattr_t"]
        [::std::mem::align_of::<pthread_barrierattr_t>() - 4usize];
    ["Offset of field: pthread_barrierattr_t::__size"]
        [::std::mem::offset_of!(pthread_barrierattr_t, __size) - 0usize];
    ["Offset of field: pthread_barrierattr_t::__align"]
        [::std::mem::offset_of!(pthread_barrierattr_t, __align) - 0usize];
};
pub type my_bool = ::std::os::raw::c_char;
pub type my_ulonglong = ::std::os::raw::c_ulonglong;
pub type my_socket = ::std::os::raw::c_int;
pub const Item_result_STRING_RESULT: Item_result = 0;
pub const Item_result_REAL_RESULT: Item_result = 1;
pub const Item_result_INT_RESULT: Item_result = 2;
pub const Item_result_ROW_RESULT: Item_result = 3;
pub const Item_result_DECIMAL_RESULT: Item_result = 4;
pub type Item_result = ::std::os::raw::c_uint;
pub const mysql_enum_shutdown_level_SHUTDOWN_DEFAULT: mysql_enum_shutdown_level = 0;
pub const mysql_enum_shutdown_level_KILL_QUERY: mysql_enum_shutdown_level = 254;
pub const mysql_enum_shutdown_level_KILL_CONNECTION: mysql_enum_shutdown_level = 255;
pub type mysql_enum_shutdown_level = ::std::os::raw::c_uint;
pub const enum_server_command_COM_SLEEP: enum_server_command = 0;
pub const enum_server_command_COM_QUIT: enum_server_command = 1;
pub const enum_server_command_COM_INIT_DB: enum_server_command = 2;
pub const enum_server_command_COM_QUERY: enum_server_command = 3;
pub const enum_server_command_COM_FIELD_LIST: enum_server_command = 4;
pub const enum_server_command_COM_CREATE_DB: enum_server_command = 5;
pub const enum_server_command_COM_DROP_DB: enum_server_command = 6;
pub const enum_server_command_COM_REFRESH: enum_server_command = 7;
pub const enum_server_command_COM_SHUTDOWN: enum_server_command = 8;
pub const enum_server_command_COM_STATISTICS: enum_server_command = 9;
pub const enum_server_command_COM_PROCESS_INFO: enum_server_command = 10;
pub const enum_server_command_COM_CONNECT: enum_server_command = 11;
pub const enum_server_command_COM_PROCESS_KILL: enum_server_command = 12;
pub const enum_server_command_COM_DEBUG: enum_server_command = 13;
pub const enum_server_command_COM_PING: enum_server_command = 14;
pub const enum_server_command_COM_TIME: enum_server_command = 15;
pub const enum_server_command_COM_DELAYED_INSERT: enum_server_command = 16;
pub const enum_server_command_COM_CHANGE_USER: enum_server_command = 17;
pub const enum_server_command_COM_BINLOG_DUMP: enum_server_command = 18;
pub const enum_server_command_COM_TABLE_DUMP: enum_server_command = 19;
pub const enum_server_command_COM_CONNECT_OUT: enum_server_command = 20;
pub const enum_server_command_COM_REGISTER_SLAVE: enum_server_command = 21;
pub const enum_server_command_COM_STMT_PREPARE: enum_server_command = 22;
pub const enum_server_command_COM_STMT_EXECUTE: enum_server_command = 23;
pub const enum_server_command_COM_STMT_SEND_LONG_DATA: enum_server_command = 24;
pub const enum_server_command_COM_STMT_CLOSE: enum_server_command = 25;
pub const enum_server_command_COM_STMT_RESET: enum_server_command = 26;
pub const enum_server_command_COM_SET_OPTION: enum_server_command = 27;
pub const enum_server_command_COM_STMT_FETCH: enum_server_command = 28;
pub const enum_server_command_COM_DAEMON: enum_server_command = 29;
pub const enum_server_command_COM_UNSUPPORTED: enum_server_command = 30;
pub const enum_server_command_COM_RESET_CONNECTION: enum_server_command = 31;
pub const enum_server_command_COM_STMT_BULK_EXECUTE: enum_server_command = 250;
pub const enum_server_command_COM_RESERVED_1: enum_server_command = 254;
pub const enum_server_command_COM_END: enum_server_command = 255;
pub type enum_server_command = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct st_ma_pvio {
    _unused: [u8; 0],
}
pub type MARIADB_PVIO = st_ma_pvio;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct st_ma_connection_plugin {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct st_net {
    pub pvio: *mut MARIADB_PVIO,
    pub buff: *mut ::std::os::raw::c_uchar,
    pub buff_end: *mut ::std::os::raw::c_uchar,
    pub write_pos: *mut ::std::os::raw::c_uchar,
    pub read_pos: *mut ::std::os::raw::c_uchar,
    pub fd: my_socket,
    pub remain_in_buf: ::std::os::raw::c_ulong,
    pub length: ::std::os::raw::c_ulong,
    pub buf_length: ::std::os::raw::c_ulong,
    pub where_b: ::std::os::raw::c_ulong,
    pub max_packet: ::std::os::raw::c_ulong,
    pub max_packet_size: ::std::os::raw::c_ulong,
    pub pkt_nr: ::std::os::raw::c_uint,
    pub compress_pkt_nr: ::std::os::raw::c_uint,
    pub write_timeout: ::std::os::raw::c_uint,
    pub read_timeout: ::std::os::raw::c_uint,
    pub retry_count: ::std::os::raw::c_uint,
    pub fcntl: ::std::os::raw::c_int,
    pub return_status: *mut ::std::os::raw::c_uint,
    pub reading_or_writing: ::std::os::raw::c_uchar,
    pub save_char: ::std::os::raw::c_char,
    pub unused_1: ::std::os::raw::c_char,
    pub tls_verify_status: ::std::os::raw::c_uchar,
    pub compress: my_bool,
    pub unused_2: my_bool,
    pub unused_3: *mut ::std::os::raw::c_char,
    pub last_errno: ::std::os::raw::c_uint,
    pub error: ::std::os::raw::c_uchar,
    pub unused_5: my_bool,
    pub unused_6: my_bool,
    pub last_error: [::std::os::raw::c_char; 512usize],
    pub sqlstate: [::std::os::raw::c_char; 6usize],
    pub extension: *mut st_mariadb_net_extension,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of st_net"][::std::mem::size_of::<st_net>() - 680usize];
    ["Alignment of st_net"][::std::mem::align_of::<st_net>() - 8usize];
    ["Offset of field: st_net::pvio"][::std::mem::offset_of!(st_net, pvio) - 0usize];
    ["Offset of field: st_net::buff"][::std::mem::offset_of!(st_net, buff) - 8usize];
    ["Offset of field: st_net::buff_end"][::std::mem::offset_of!(st_net, buff_end) - 16usize];
    ["Offset of field: st_net::write_pos"][::std::mem::offset_of!(st_net, write_pos) - 24usize];
    ["Offset of field: st_net::read_pos"][::std::mem::offset_of!(st_net, read_pos) - 32usize];
    ["Offset of field: st_net::fd"][::std::mem::offset_of!(st_net, fd) - 40usize];
    ["Offset of field: st_net::remain_in_buf"]
        [::std::mem::offset_of!(st_net, remain_in_buf) - 48usize];
    ["Offset of field: st_net::length"][::std::mem::offset_of!(st_net, length) - 56usize];
    ["Offset of field: st_net::buf_length"][::std::mem::offset_of!(st_net, buf_length) - 64usize];
    ["Offset of field: st_net::where_b"][::std::mem::offset_of!(st_net, where_b) - 72usize];
    ["Offset of field: st_net::max_packet"][::std::mem::offset_of!(st_net, max_packet) - 80usize];
    ["Offset of field: st_net::max_packet_size"]
        [::std::mem::offset_of!(st_net, max_packet_size) - 88usize];
    ["Offset of field: st_net::pkt_nr"][::std::mem::offset_of!(st_net, pkt_nr) - 96usize];
    ["Offset of field: st_net::compress_pkt_nr"]
        [::std::mem::offset_of!(st_net, compress_pkt_nr) - 100usize];
    ["Offset of field: st_net::write_timeout"]
        [::std::mem::offset_of!(st_net, write_timeout) - 104usize];
    ["Offset of field: st_net::read_timeout"]
        [::std::mem::offset_of!(st_net, read_timeout) - 108usize];
    ["Offset of field: st_net::retry_count"]
        [::std::mem::offset_of!(st_net, retry_count) - 112usize];
    ["Offset of field: st_net::fcntl"][::std::mem::offset_of!(st_net, fcntl) - 116usize];
    ["Offset of field: st_net::return_status"]
        [::std::mem::offset_of!(st_net, return_status) - 120usize];
    ["Offset of field: st_net::reading_or_writing"]
        [::std::mem::offset_of!(st_net, reading_or_writing) - 128usize];
    ["Offset of field: st_net::save_char"][::std::mem::offset_of!(st_net, save_char) - 129usize];
    ["Offset of field: st_net::unused_1"][::std::mem::offset_of!(st_net, unused_1) - 130usize];
    ["Offset of field: st_net::tls_verify_status"]
        [::std::mem::offset_of!(st_net, tls_verify_status) - 131usize];
    ["Offset of field: st_net::compress"][::std::mem::offset_of!(st_net, compress) - 132usize];
    ["Offset of field: st_net::unused_2"][::std::mem::offset_of!(st_net, unused_2) - 133usize];
    ["Offset of field: st_net::unused_3"][::std::mem::offset_of!(st_net, unused_3) - 136usize];
    ["Offset of field: st_net::last_errno"][::std::mem::offset_of!(st_net, last_errno) - 144usize];
    ["Offset of field: st_net::error"][::std::mem::offset_of!(st_net, error) - 148usize];
    ["Offset of field: st_net::unused_5"][::std::mem::offset_of!(st_net, unused_5) - 149usize];
    ["Offset of field: st_net::unused_6"][::std::mem::offset_of!(st_net, unused_6) - 150usize];
    ["Offset of field: st_net::last_error"][::std::mem::offset_of!(st_net, last_error) - 151usize];
    ["Offset of field: st_net::sqlstate"][::std::mem::offset_of!(st_net, sqlstate) - 663usize];
    ["Offset of field: st_net::extension"][::std::mem::offset_of!(st_net, extension) - 672usize];
};
pub type NET = st_net;
pub const enum_mysql_set_option_MYSQL_OPTION_MULTI_STATEMENTS_ON: enum_mysql_set_option = 0;
pub const enum_mysql_set_option_MYSQL_OPTION_MULTI_STATEMENTS_OFF: enum_mysql_set_option = 1;
pub type enum_mysql_set_option = ::std::os::raw::c_uint;
pub const enum_mariadb_status_info_STATUS_TYPE: enum_mariadb_status_info = 0;
pub const enum_mariadb_status_info_SESSION_TRACK_TYPE: enum_mariadb_status_info = 1;
pub type enum_mariadb_status_info = ::std::os::raw::c_uint;
pub const enum_session_state_type_SESSION_TRACK_SYSTEM_VARIABLES: enum_session_state_type = 0;
pub const enum_session_state_type_SESSION_TRACK_SCHEMA: enum_session_state_type = 1;
pub const enum_session_state_type_SESSION_TRACK_STATE_CHANGE: enum_session_state_type = 2;
pub const enum_session_state_type_SESSION_TRACK_GTIDS: enum_session_state_type = 3;
pub const enum_session_state_type_SESSION_TRACK_TRANSACTION_CHARACTERISTICS:
    enum_session_state_type = 4;
pub const enum_session_state_type_SESSION_TRACK_TRANSACTION_STATE: enum_session_state_type = 5;
pub type enum_session_state_type = ::std::os::raw::c_uint;
pub const enum_field_types_MYSQL_TYPE_DECIMAL: enum_field_types = 0;
pub const enum_field_types_MYSQL_TYPE_TINY: enum_field_types = 1;
pub const enum_field_types_MYSQL_TYPE_SHORT: enum_field_types = 2;
pub const enum_field_types_MYSQL_TYPE_LONG: enum_field_types = 3;
pub const enum_field_types_MYSQL_TYPE_FLOAT: enum_field_types = 4;
pub const enum_field_types_MYSQL_TYPE_DOUBLE: enum_field_types = 5;
pub const enum_field_types_MYSQL_TYPE_NULL: enum_field_types = 6;
pub const enum_field_types_MYSQL_TYPE_TIMESTAMP: enum_field_types = 7;
pub const enum_field_types_MYSQL_TYPE_LONGLONG: enum_field_types = 8;
pub const enum_field_types_MYSQL_TYPE_INT24: enum_field_types = 9;
pub const enum_field_types_MYSQL_TYPE_DATE: enum_field_types = 10;
pub const enum_field_types_MYSQL_TYPE_TIME: enum_field_types = 11;
pub const enum_field_types_MYSQL_TYPE_DATETIME: enum_field_types = 12;
pub const enum_field_types_MYSQL_TYPE_YEAR: enum_field_types = 13;
pub const enum_field_types_MYSQL_TYPE_NEWDATE: enum_field_types = 14;
pub const enum_field_types_MYSQL_TYPE_VARCHAR: enum_field_types = 15;
pub const enum_field_types_MYSQL_TYPE_BIT: enum_field_types = 16;
pub const enum_field_types_MYSQL_TYPE_TIMESTAMP2: enum_field_types = 17;
pub const enum_field_types_MYSQL_TYPE_DATETIME2: enum_field_types = 18;
pub const enum_field_types_MYSQL_TYPE_TIME2: enum_field_types = 19;
pub const enum_field_types_MYSQL_TYPE_JSON: enum_field_types = 245;
pub const enum_field_types_MYSQL_TYPE_NEWDECIMAL: enum_field_types = 246;
pub const enum_field_types_MYSQL_TYPE_ENUM: enum_field_types = 247;
pub const enum_field_types_MYSQL_TYPE_SET: enum_field_types = 248;
pub const enum_field_types_MYSQL_TYPE_TINY_BLOB: enum_field_types = 249;
pub const enum_field_types_MYSQL_TYPE_MEDIUM_BLOB: enum_field_types = 250;
pub const enum_field_types_MYSQL_TYPE_LONG_BLOB: enum_field_types = 251;
pub const enum_field_types_MYSQL_TYPE_BLOB: enum_field_types = 252;
pub const enum_field_types_MYSQL_TYPE_VAR_STRING: enum_field_types = 253;
pub const enum_field_types_MYSQL_TYPE_STRING: enum_field_types = 254;
pub const enum_field_types_MYSQL_TYPE_GEOMETRY: enum_field_types = 255;
pub const enum_field_types_MAX_NO_FIELD_TYPES: enum_field_types = 256;
pub type enum_field_types = ::std::os::raw::c_uint;
unsafe extern "C" {
    pub static mut max_allowed_packet: ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub static mut net_buffer_length: ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn ma_net_init(net: *mut NET, pvio: *mut MARIADB_PVIO) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ma_net_end(net: *mut NET);
}
unsafe extern "C" {
    pub fn ma_net_clear(net: *mut NET);
}
unsafe extern "C" {
    pub fn ma_net_flush(net: *mut NET) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ma_net_write(
        net: *mut NET,
        packet: *const ::std::os::raw::c_uchar,
        len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ma_net_write_buff(
        net: *mut NET,
        packet: *const ::std::os::raw::c_char,
        len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ma_net_write_command(
        net: *mut NET,
        command: ::std::os::raw::c_uchar,
        packet: *const ::std::os::raw::c_char,
        len: usize,
        disable_flush: my_bool,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ma_net_real_write(
        net: *mut NET,
        packet: *const ::std::os::raw::c_char,
        len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ma_net_read(net: *mut NET) -> ::std::os::raw::c_ulong;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rand_struct {
    pub seed1: ::std::os::raw::c_ulong,
    pub seed2: ::std::os::raw::c_ulong,
    pub max_value: ::std::os::raw::c_ulong,
    pub max_value_dbl: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rand_struct"][::std::mem::size_of::<rand_struct>() - 32usize];
    ["Alignment of rand_struct"][::std::mem::align_of::<rand_struct>() - 8usize];
    ["Offset of field: rand_struct::seed1"][::std::mem::offset_of!(rand_struct, seed1) - 0usize];
    ["Offset of field: rand_struct::seed2"][::std::mem::offset_of!(rand_struct, seed2) - 8usize];
    ["Offset of field: rand_struct::max_value"]
        [::std::mem::offset_of!(rand_struct, max_value) - 16usize];
    ["Offset of field: rand_struct::max_value_dbl"]
        [::std::mem::offset_of!(rand_struct, max_value_dbl) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct st_udf_args {
    pub arg_count: ::std::os::raw::c_uint,
    pub arg_type: *mut Item_result,
    pub args: *mut *mut ::std::os::raw::c_char,
    pub lengths: *mut ::std::os::raw::c_ulong,
    pub maybe_null: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of st_udf_args"][::std::mem::size_of::<st_udf_args>() - 40usize];
    ["Alignment of st_udf_args"][::std::mem::align_of::<st_udf_args>() - 8usize];
    ["Offset of field: st_udf_args::arg_count"]
        [::std::mem::offset_of!(st_udf_args, arg_count) - 0usize];
    ["Offset of field: st_udf_args::arg_type"]
        [::std::mem::offset_of!(st_udf_args, arg_type) - 8usize];
    ["Offset of field: st_udf_args::args"][::std::mem::offset_of!(st_udf_args, args) - 16usize];
    ["Offset of field: st_udf_args::lengths"]
        [::std::mem::offset_of!(st_udf_args, lengths) - 24usize];
    ["Offset of field: st_udf_args::maybe_null"]
        [::std::mem::offset_of!(st_udf_args, maybe_null) - 32usize];
};
pub type UDF_ARGS = st_udf_args;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct st_udf_init {
    pub maybe_null: my_bool,
    pub decimals: ::std::os::raw::c_uint,
    pub max_length: ::std::os::raw::c_uint,
    pub ptr: *mut ::std::os::raw::c_char,
    pub const_item: my_bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of st_udf_init"][::std::mem::size_of::<st_udf_init>() - 32usize];
    ["Alignment of st_udf_init"][::std::mem::align_of::<st_udf_init>() - 8usize];
    ["Offset of field: st_udf_init::maybe_null"]
        [::std::mem::offset_of!(st_udf_init, maybe_null) - 0usize];
    ["Offset of field: st_udf_init::decimals"]
        [::std::mem::offset_of!(st_udf_init, decimals) - 4usize];
    ["Offset of field: st_udf_init::max_length"]
        [::std::mem::offset_of!(st_udf_init, max_length) - 8usize];
    ["Offset of field: st_udf_init::ptr"][::std::mem::offset_of!(st_udf_init, ptr) - 16usize];
    ["Offset of field: st_udf_init::const_item"]
        [::std::mem::offset_of!(st_udf_init, const_item) - 24usize];
};
pub type UDF_INIT = st_udf_init;
unsafe extern "C" {
    pub fn ma_scramble_323(
        to: *mut ::std::os::raw::c_char,
        message: *const ::std::os::raw::c_char,
        password: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ma_scramble_41(
        buffer: *const ::std::os::raw::c_uchar,
        scramble: *const ::std::os::raw::c_char,
        password: *const ::std::os::raw::c_char,
    );
}
unsafe extern "C" {
    pub fn ma_hash_password(
        result: *mut ::std::os::raw::c_ulong,
        password: *const ::std::os::raw::c_char,
        len: usize,
    );
}
unsafe extern "C" {
    pub fn ma_make_scrambled_password(
        to: *mut ::std::os::raw::c_char,
        password: *const ::std::os::raw::c_char,
    );
}
unsafe extern "C" {
    pub fn mariadb_load_defaults(
        conf_file: *const ::std::os::raw::c_char,
        groups: *mut *const ::std::os::raw::c_char,
        argc: *mut ::std::os::raw::c_int,
        argv: *mut *mut *mut ::std::os::raw::c_char,
    );
}
unsafe extern "C" {
    pub fn ma_thread_init() -> my_bool;
}
unsafe extern "C" {
    pub fn ma_thread_end();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct st_list {
    pub prev: *mut st_list,
    pub next: *mut st_list,
    pub data: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of st_list"][::std::mem::size_of::<st_list>() - 24usize];
    ["Alignment of st_list"][::std::mem::align_of::<st_list>() - 8usize];
    ["Offset of field: st_list::prev"][::std::mem::offset_of!(st_list, prev) - 0usize];
    ["Offset of field: st_list::next"][::std::mem::offset_of!(st_list, next) - 8usize];
    ["Offset of field: st_list::data"][::std::mem::offset_of!(st_list, data) - 16usize];
};
pub type LIST = st_list;
pub type list_walk_action = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
unsafe extern "C" {
    pub fn list_add(root: *mut LIST, element: *mut LIST) -> *mut LIST;
}
unsafe extern "C" {
    pub fn list_delete(root: *mut LIST, element: *mut LIST) -> *mut LIST;
}
unsafe extern "C" {
    pub fn list_cons(data: *mut ::std::os::raw::c_void, root: *mut LIST) -> *mut LIST;
}
unsafe extern "C" {
    pub fn list_reverse(root: *mut LIST) -> *mut LIST;
}
unsafe extern "C" {
    pub fn list_free(root: *mut LIST, free_data: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn list_length(list: *mut LIST) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn list_walk(
        list: *mut LIST,
        action: list_walk_action,
        argument: *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
pub const _ISupper: _bindgen_ty_1 = 256;
pub const _ISlower: _bindgen_ty_1 = 512;
pub const _ISalpha: _bindgen_ty_1 = 1024;
pub const _ISdigit: _bindgen_ty_1 = 2048;
pub const _ISxdigit: _bindgen_ty_1 = 4096;
pub const _ISspace: _bindgen_ty_1 = 8192;
pub const _ISprint: _bindgen_ty_1 = 16384;
pub const _ISgraph: _bindgen_ty_1 = 32768;
pub const _ISblank: _bindgen_ty_1 = 1;
pub const _IScntrl: _bindgen_ty_1 = 2;
pub const _ISpunct: _bindgen_ty_1 = 4;
pub const _ISalnum: _bindgen_ty_1 = 8;
pub type _bindgen_ty_1 = ::std::os::raw::c_uint;
unsafe extern "C" {
    pub fn __ctype_b_loc() -> *mut *const ::std::os::raw::c_ushort;
}
unsafe extern "C" {
    pub fn __ctype_tolower_loc() -> *mut *const __int32_t;
}
unsafe extern "C" {
    pub fn __ctype_toupper_loc() -> *mut *const __int32_t;
}
unsafe extern "C" {
    pub fn isalnum(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isalpha(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn iscntrl(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isdigit(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn islower(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isgraph(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isprint(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ispunct(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isspace(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isupper(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isxdigit(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn tolower(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn toupper(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isblank(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isascii(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn toascii(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _toupper(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _tolower(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isalnum_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isalpha_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn iscntrl_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isdigit_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn islower_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isgraph_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isprint_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ispunct_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isspace_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isupper_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isxdigit_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isblank_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __tolower_l(__c: ::std::os::raw::c_int, __l: locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn tolower_l(__c: ::std::os::raw::c_int, __l: locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __toupper_l(__c: ::std::os::raw::c_int, __l: locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn toupper_l(__c: ::std::os::raw::c_int, __l: locale_t) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_charset_info_st {
    pub nr: ::std::os::raw::c_uint,
    pub state: ::std::os::raw::c_uint,
    pub csname: *const ::std::os::raw::c_char,
    pub name: *const ::std::os::raw::c_char,
    pub dir: *const ::std::os::raw::c_char,
    pub codepage: ::std::os::raw::c_uint,
    pub encoding: *const ::std::os::raw::c_char,
    pub char_minlen: ::std::os::raw::c_uint,
    pub char_maxlen: ::std::os::raw::c_uint,
    pub mb_charlen: ::std::option::Option<
        unsafe extern "C" fn(c: ::std::os::raw::c_uint) -> ::std::os::raw::c_uint,
    >,
    pub mb_valid: ::std::option::Option<
        unsafe extern "C" fn(
            start: *const ::std::os::raw::c_char,
            end: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_uint,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ma_charset_info_st"][::std::mem::size_of::<ma_charset_info_st>() - 72usize];
    ["Alignment of ma_charset_info_st"][::std::mem::align_of::<ma_charset_info_st>() - 8usize];
    ["Offset of field: ma_charset_info_st::nr"]
        [::std::mem::offset_of!(ma_charset_info_st, nr) - 0usize];
    ["Offset of field: ma_charset_info_st::state"]
        [::std::mem::offset_of!(ma_charset_info_st, state) - 4usize];
    ["Offset of field: ma_charset_info_st::csname"]
        [::std::mem::offset_of!(ma_charset_info_st, csname) - 8usize];
    ["Offset of field: ma_charset_info_st::name"]
        [::std::mem::offset_of!(ma_charset_info_st, name) - 16usize];
    ["Offset of field: ma_charset_info_st::dir"]
        [::std::mem::offset_of!(ma_charset_info_st, dir) - 24usize];
    ["Offset of field: ma_charset_info_st::codepage"]
        [::std::mem::offset_of!(ma_charset_info_st, codepage) - 32usize];
    ["Offset of field: ma_charset_info_st::encoding"]
        [::std::mem::offset_of!(ma_charset_info_st, encoding) - 40usize];
    ["Offset of field: ma_charset_info_st::char_minlen"]
        [::std::mem::offset_of!(ma_charset_info_st, char_minlen) - 48usize];
    ["Offset of field: ma_charset_info_st::char_maxlen"]
        [::std::mem::offset_of!(ma_charset_info_st, char_maxlen) - 52usize];
    ["Offset of field: ma_charset_info_st::mb_charlen"]
        [::std::mem::offset_of!(ma_charset_info_st, mb_charlen) - 56usize];
    ["Offset of field: ma_charset_info_st::mb_valid"]
        [::std::mem::offset_of!(ma_charset_info_st, mb_valid) - 64usize];
};
pub type MARIADB_CHARSET_INFO = ma_charset_info_st;
unsafe extern "C" {
    pub static mariadb_compiled_charsets: [MARIADB_CHARSET_INFO; 0usize];
}
unsafe extern "C" {
    pub static mut ma_default_charset_info: *mut MARIADB_CHARSET_INFO;
}
unsafe extern "C" {
    pub static mut ma_charset_bin: *mut MARIADB_CHARSET_INFO;
}
unsafe extern "C" {
    pub static mut ma_charset_latin1: *mut MARIADB_CHARSET_INFO;
}
unsafe extern "C" {
    pub static mut ma_charset_utf8_general_ci: *mut MARIADB_CHARSET_INFO;
}
unsafe extern "C" {
    pub static mut ma_charset_utf16le_general_ci: *mut MARIADB_CHARSET_INFO;
}
unsafe extern "C" {
    pub fn find_compiled_charset(cs_number: ::std::os::raw::c_uint) -> *mut MARIADB_CHARSET_INFO;
}
unsafe extern "C" {
    pub fn find_compiled_charset_by_name(
        name: *const ::std::os::raw::c_char,
    ) -> *mut MARIADB_CHARSET_INFO;
}
unsafe extern "C" {
    pub fn mysql_cset_escape_quotes(
        cset: *const MARIADB_CHARSET_INFO,
        newstr: *mut ::std::os::raw::c_char,
        escapestr: *const ::std::os::raw::c_char,
        escapestr_len: usize,
    ) -> usize;
}
unsafe extern "C" {
    pub fn mysql_cset_escape_slashes(
        cset: *const MARIADB_CHARSET_INFO,
        newstr: *mut ::std::os::raw::c_char,
        escapestr: *const ::std::os::raw::c_char,
        escapestr_len: usize,
    ) -> usize;
}
unsafe extern "C" {
    pub fn madb_get_os_character_set() -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct st_ma_const_string {
    pub str_: *const ::std::os::raw::c_char,
    pub length: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of st_ma_const_string"][::std::mem::size_of::<st_ma_const_string>() - 16usize];
    ["Alignment of st_ma_const_string"][::std::mem::align_of::<st_ma_const_string>() - 8usize];
    ["Offset of field: st_ma_const_string::str_"]
        [::std::mem::offset_of!(st_ma_const_string, str_) - 0usize];
    ["Offset of field: st_ma_const_string::length"]
        [::std::mem::offset_of!(st_ma_const_string, length) - 8usize];
};
pub type MARIADB_CONST_STRING = st_ma_const_string;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct st_ma_const_data {
    pub data: *const ::std::os::raw::c_uchar,
    pub length: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of st_ma_const_data"][::std::mem::size_of::<st_ma_const_data>() - 16usize];
    ["Alignment of st_ma_const_data"][::std::mem::align_of::<st_ma_const_data>() - 8usize];
    ["Offset of field: st_ma_const_data::data"]
        [::std::mem::offset_of!(st_ma_const_data, data) - 0usize];
    ["Offset of field: st_ma_const_data::length"]
        [::std::mem::offset_of!(st_ma_const_data, length) - 8usize];
};
pub type MARIADB_CONST_DATA = st_ma_const_data;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct st_ma_used_mem {
    pub next: *mut st_ma_used_mem,
    pub left: usize,
    pub size: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of st_ma_used_mem"][::std::mem::size_of::<st_ma_used_mem>() - 24usize];
    ["Alignment of st_ma_used_mem"][::std::mem::align_of::<st_ma_used_mem>() - 8usize];
    ["Offset of field: st_ma_used_mem::next"]
        [::std::mem::offset_of!(st_ma_used_mem, next) - 0usize];
    ["Offset of field: st_ma_used_mem::left"]
        [::std::mem::offset_of!(st_ma_used_mem, left) - 8usize];
    ["Offset of field: st_ma_used_mem::size"]
        [::std::mem::offset_of!(st_ma_used_mem, size) - 16usize];
};
pub type MA_USED_MEM = st_ma_used_mem;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct st_ma_mem_root {
    pub free: *mut MA_USED_MEM,
    pub used: *mut MA_USED_MEM,
    pub pre_alloc: *mut MA_USED_MEM,
    pub min_malloc: usize,
    pub block_size: usize,
    pub block_num: ::std::os::raw::c_uint,
    pub first_block_usage: ::std::os::raw::c_uint,
    pub error_handler: ::std::option::Option<unsafe extern "C" fn()>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of st_ma_mem_root"][::std::mem::size_of::<st_ma_mem_root>() - 56usize];
    ["Alignment of st_ma_mem_root"][::std::mem::align_of::<st_ma_mem_root>() - 8usize];
    ["Offset of field: st_ma_mem_root::free"]
        [::std::mem::offset_of!(st_ma_mem_root, free) - 0usize];
    ["Offset of field: st_ma_mem_root::used"]
        [::std::mem::offset_of!(st_ma_mem_root, used) - 8usize];
    ["Offset of field: st_ma_mem_root::pre_alloc"]
        [::std::mem::offset_of!(st_ma_mem_root, pre_alloc) - 16usize];
    ["Offset of field: st_ma_mem_root::min_malloc"]
        [::std::mem::offset_of!(st_ma_mem_root, min_malloc) - 24usize];
    ["Offset of field: st_ma_mem_root::block_size"]
        [::std::mem::offset_of!(st_ma_mem_root, block_size) - 32usize];
    ["Offset of field: st_ma_mem_root::block_num"]
        [::std::mem::offset_of!(st_ma_mem_root, block_num) - 40usize];
    ["Offset of field: st_ma_mem_root::first_block_usage"]
        [::std::mem::offset_of!(st_ma_mem_root, first_block_usage) - 44usize];
    ["Offset of field: st_ma_mem_root::error_handler"]
        [::std::mem::offset_of!(st_ma_mem_root, error_handler) - 48usize];
};
pub type MA_MEM_ROOT = st_ma_mem_root;
unsafe extern "C" {
    pub static mut mysql_port: ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub static mut mysql_unix_port: *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub static mut mariadb_deinitialize_ssl: ::std::os::raw::c_uint;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct st_mysql_field {
    pub name: *mut ::std::os::raw::c_char,
    pub org_name: *mut ::std::os::raw::c_char,
    pub table: *mut ::std::os::raw::c_char,
    pub org_table: *mut ::std::os::raw::c_char,
    pub db: *mut ::std::os::raw::c_char,
    pub catalog: *mut ::std::os::raw::c_char,
    pub def: *mut ::std::os::raw::c_char,
    pub length: ::std::os::raw::c_ulong,
    pub max_length: ::std::os::raw::c_ulong,
    pub name_length: ::std::os::raw::c_uint,
    pub org_name_length: ::std::os::raw::c_uint,
    pub table_length: ::std::os::raw::c_uint,
    pub org_table_length: ::std::os::raw::c_uint,
    pub db_length: ::std::os::raw::c_uint,
    pub catalog_length: ::std::os::raw::c_uint,
    pub def_length: ::std::os::raw::c_uint,
    pub flags: ::std::os::raw::c_uint,
    pub decimals: ::std::os::raw::c_uint,
    pub charsetnr: ::std::os::raw::c_uint,
    pub type_: enum_field_types,
    pub extension: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of st_mysql_field"][::std::mem::size_of::<st_mysql_field>() - 128usize];
    ["Alignment of st_mysql_field"][::std::mem::align_of::<st_mysql_field>() - 8usize];
    ["Offset of field: st_mysql_field::name"]
        [::std::mem::offset_of!(st_mysql_field, name) - 0usize];
    ["Offset of field: st_mysql_field::org_name"]
        [::std::mem::offset_of!(st_mysql_field, org_name) - 8usize];
    ["Offset of field: st_mysql_field::table"]
        [::std::mem::offset_of!(st_mysql_field, table) - 16usize];
    ["Offset of field: st_mysql_field::org_table"]
        [::std::mem::offset_of!(st_mysql_field, org_table) - 24usize];
    ["Offset of field: st_mysql_field::db"][::std::mem::offset_of!(st_mysql_field, db) - 32usize];
    ["Offset of field: st_mysql_field::catalog"]
        [::std::mem::offset_of!(st_mysql_field, catalog) - 40usize];
    ["Offset of field: st_mysql_field::def"][::std::mem::offset_of!(st_mysql_field, def) - 48usize];
    ["Offset of field: st_mysql_field::length"]
        [::std::mem::offset_of!(st_mysql_field, length) - 56usize];
    ["Offset of field: st_mysql_field::max_length"]
        [::std::mem::offset_of!(st_mysql_field, max_length) - 64usize];
    ["Offset of field: st_mysql_field::name_length"]
        [::std::mem::offset_of!(st_mysql_field, name_length) - 72usize];
    ["Offset of field: st_mysql_field::org_name_length"]
        [::std::mem::offset_of!(st_mysql_field, org_name_length) - 76usize];
    ["Offset of field: st_mysql_field::table_length"]
        [::std::mem::offset_of!(st_mysql_field, table_length) - 80usize];
    ["Offset of field: st_mysql_field::org_table_length"]
        [::std::mem::offset_of!(st_mysql_field, org_table_length) - 84usize];
    ["Offset of field: st_mysql_field::db_length"]
        [::std::mem::offset_of!(st_mysql_field, db_length) - 88usize];
    ["Offset of field: st_mysql_field::catalog_length"]
        [::std::mem::offset_of!(st_mysql_field, catalog_length) - 92usize];
    ["Offset of field: st_mysql_field::def_length"]
        [::std::mem::offset_of!(st_mysql_field, def_length) - 96usize];
    ["Offset of field: st_mysql_field::flags"]
        [::std::mem::offset_of!(st_mysql_field, flags) - 100usize];
    ["Offset of field: st_mysql_field::decimals"]
        [::std::mem::offset_of!(st_mysql_field, decimals) - 104usize];
    ["Offset of field: st_mysql_field::charsetnr"]
        [::std::mem::offset_of!(st_mysql_field, charsetnr) - 108usize];
    ["Offset of field: st_mysql_field::type_"]
        [::std::mem::offset_of!(st_mysql_field, type_) - 112usize];
    ["Offset of field: st_mysql_field::extension"]
        [::std::mem::offset_of!(st_mysql_field, extension) - 120usize];
};
pub type MYSQL_FIELD = st_mysql_field;
pub type MYSQL_ROW = *mut *mut ::std::os::raw::c_char;
pub type MYSQL_FIELD_OFFSET = ::std::os::raw::c_uint;
unsafe extern "C" {
    pub static mut SQLSTATE_UNKNOWN: *const ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct st_mysql_rows {
    pub next: *mut st_mysql_rows,
    pub data: MYSQL_ROW,
    pub length: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of st_mysql_rows"][::std::mem::size_of::<st_mysql_rows>() - 24usize];
    ["Alignment of st_mysql_rows"][::std::mem::align_of::<st_mysql_rows>() - 8usize];
    ["Offset of field: st_mysql_rows::next"][::std::mem::offset_of!(st_mysql_rows, next) - 0usize];
    ["Offset of field: st_mysql_rows::data"][::std::mem::offset_of!(st_mysql_rows, data) - 8usize];
    ["Offset of field: st_mysql_rows::length"]
        [::std::mem::offset_of!(st_mysql_rows, length) - 16usize];
};
pub type MYSQL_ROWS = st_mysql_rows;
pub type MYSQL_ROW_OFFSET = *mut MYSQL_ROWS;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct st_mysql_data {
    pub data: *mut MYSQL_ROWS,
    pub embedded_info: *mut ::std::os::raw::c_void,
    pub alloc: MA_MEM_ROOT,
    pub rows: ::std::os::raw::c_ulonglong,
    pub fields: ::std::os::raw::c_uint,
    pub extension: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of st_mysql_data"][::std::mem::size_of::<st_mysql_data>() - 96usize];
    ["Alignment of st_mysql_data"][::std::mem::align_of::<st_mysql_data>() - 8usize];
    ["Offset of field: st_mysql_data::data"][::std::mem::offset_of!(st_mysql_data, data) - 0usize];
    ["Offset of field: st_mysql_data::embedded_info"]
        [::std::mem::offset_of!(st_mysql_data, embedded_info) - 8usize];
    ["Offset of field: st_mysql_data::alloc"]
        [::std::mem::offset_of!(st_mysql_data, alloc) - 16usize];
    ["Offset of field: st_mysql_data::rows"][::std::mem::offset_of!(st_mysql_data, rows) - 72usize];
    ["Offset of field: st_mysql_data::fields"]
        [::std::mem::offset_of!(st_mysql_data, fields) - 80usize];
    ["Offset of field: st_mysql_data::extension"]
        [::std::mem::offset_of!(st_mysql_data, extension) - 88usize];
};
pub type MYSQL_DATA = st_mysql_data;
pub const mysql_option_MYSQL_OPT_CONNECT_TIMEOUT: mysql_option = 0;
pub const mysql_option_MYSQL_OPT_COMPRESS: mysql_option = 1;
pub const mysql_option_MYSQL_OPT_NAMED_PIPE: mysql_option = 2;
pub const mysql_option_MYSQL_INIT_COMMAND: mysql_option = 3;
pub const mysql_option_MYSQL_READ_DEFAULT_FILE: mysql_option = 4;
pub const mysql_option_MYSQL_READ_DEFAULT_GROUP: mysql_option = 5;
pub const mysql_option_MYSQL_SET_CHARSET_DIR: mysql_option = 6;
pub const mysql_option_MYSQL_SET_CHARSET_NAME: mysql_option = 7;
pub const mysql_option_MYSQL_OPT_LOCAL_INFILE: mysql_option = 8;
pub const mysql_option_MYSQL_OPT_PROTOCOL: mysql_option = 9;
pub const mysql_option_MYSQL_SHARED_MEMORY_BASE_NAME: mysql_option = 10;
pub const mysql_option_MYSQL_OPT_READ_TIMEOUT: mysql_option = 11;
pub const mysql_option_MYSQL_OPT_WRITE_TIMEOUT: mysql_option = 12;
pub const mysql_option_MYSQL_OPT_USE_RESULT: mysql_option = 13;
pub const mysql_option_MYSQL_OPT_USE_REMOTE_CONNECTION: mysql_option = 14;
pub const mysql_option_MYSQL_OPT_USE_EMBEDDED_CONNECTION: mysql_option = 15;
pub const mysql_option_MYSQL_OPT_GUESS_CONNECTION: mysql_option = 16;
pub const mysql_option_MYSQL_SET_CLIENT_IP: mysql_option = 17;
pub const mysql_option_MYSQL_SECURE_AUTH: mysql_option = 18;
pub const mysql_option_MYSQL_REPORT_DATA_TRUNCATION: mysql_option = 19;
pub const mysql_option_MYSQL_OPT_RECONNECT: mysql_option = 20;
pub const mysql_option_MYSQL_OPT_SSL_VERIFY_SERVER_CERT: mysql_option = 21;
pub const mysql_option_MYSQL_PLUGIN_DIR: mysql_option = 22;
pub const mysql_option_MYSQL_DEFAULT_AUTH: mysql_option = 23;
pub const mysql_option_MYSQL_OPT_BIND: mysql_option = 24;
pub const mysql_option_MYSQL_OPT_SSL_KEY: mysql_option = 25;
pub const mysql_option_MYSQL_OPT_SSL_CERT: mysql_option = 26;
pub const mysql_option_MYSQL_OPT_SSL_CA: mysql_option = 27;
pub const mysql_option_MYSQL_OPT_SSL_CAPATH: mysql_option = 28;
pub const mysql_option_MYSQL_OPT_SSL_CIPHER: mysql_option = 29;
pub const mysql_option_MYSQL_OPT_SSL_CRL: mysql_option = 30;
pub const mysql_option_MYSQL_OPT_SSL_CRLPATH: mysql_option = 31;
pub const mysql_option_MYSQL_OPT_CONNECT_ATTR_RESET: mysql_option = 32;
pub const mysql_option_MYSQL_OPT_CONNECT_ATTR_ADD: mysql_option = 33;
pub const mysql_option_MYSQL_OPT_CONNECT_ATTR_DELETE: mysql_option = 34;
pub const mysql_option_MYSQL_SERVER_PUBLIC_KEY: mysql_option = 35;
pub const mysql_option_MYSQL_ENABLE_CLEARTEXT_PLUGIN: mysql_option = 36;
pub const mysql_option_MYSQL_OPT_CAN_HANDLE_EXPIRED_PASSWORDS: mysql_option = 37;
pub const mysql_option_MYSQL_OPT_SSL_ENFORCE: mysql_option = 38;
pub const mysql_option_MYSQL_OPT_MAX_ALLOWED_PACKET: mysql_option = 39;
pub const mysql_option_MYSQL_OPT_NET_BUFFER_LENGTH: mysql_option = 40;
pub const mysql_option_MYSQL_OPT_TLS_VERSION: mysql_option = 41;
pub const mysql_option_MYSQL_OPT_ZSTD_COMPRESSION_LEVEL: mysql_option = 42;
pub const mysql_option_MYSQL_PROGRESS_CALLBACK: mysql_option = 5999;
pub const mysql_option_MYSQL_OPT_NONBLOCK: mysql_option = 6000;
pub const mysql_option_MYSQL_DATABASE_DRIVER: mysql_option = 7000;
pub const mysql_option_MARIADB_OPT_SSL_FP: mysql_option = 7001;
pub const mysql_option_MARIADB_OPT_SSL_FP_LIST: mysql_option = 7002;
pub const mysql_option_MARIADB_OPT_TLS_PASSPHRASE: mysql_option = 7003;
pub const mysql_option_MARIADB_OPT_TLS_CIPHER_STRENGTH: mysql_option = 7004;
pub const mysql_option_MARIADB_OPT_TLS_VERSION: mysql_option = 7005;
pub const mysql_option_MARIADB_OPT_TLS_PEER_FP: mysql_option = 7006;
pub const mysql_option_MARIADB_OPT_TLS_PEER_FP_LIST: mysql_option = 7007;
pub const mysql_option_MARIADB_OPT_CONNECTION_READ_ONLY: mysql_option = 7008;
pub const mysql_option_MYSQL_OPT_CONNECT_ATTRS: mysql_option = 7009;
pub const mysql_option_MARIADB_OPT_USERDATA: mysql_option = 7010;
pub const mysql_option_MARIADB_OPT_CONNECTION_HANDLER: mysql_option = 7011;
pub const mysql_option_MARIADB_OPT_PORT: mysql_option = 7012;
pub const mysql_option_MARIADB_OPT_UNIXSOCKET: mysql_option = 7013;
pub const mysql_option_MARIADB_OPT_PASSWORD: mysql_option = 7014;
pub const mysql_option_MARIADB_OPT_HOST: mysql_option = 7015;
pub const mysql_option_MARIADB_OPT_USER: mysql_option = 7016;
pub const mysql_option_MARIADB_OPT_SCHEMA: mysql_option = 7017;
pub const mysql_option_MARIADB_OPT_DEBUG: mysql_option = 7018;
pub const mysql_option_MARIADB_OPT_FOUND_ROWS: mysql_option = 7019;
pub const mysql_option_MARIADB_OPT_MULTI_RESULTS: mysql_option = 7020;
pub const mysql_option_MARIADB_OPT_MULTI_STATEMENTS: mysql_option = 7021;
pub const mysql_option_MARIADB_OPT_INTERACTIVE: mysql_option = 7022;
pub const mysql_option_MARIADB_OPT_PROXY_HEADER: mysql_option = 7023;
pub const mysql_option_MARIADB_OPT_IO_WAIT: mysql_option = 7024;
pub const mysql_option_MARIADB_OPT_SKIP_READ_RESPONSE: mysql_option = 7025;
pub const mysql_option_MARIADB_OPT_RESTRICTED_AUTH: mysql_option = 7026;
pub const mysql_option_MARIADB_OPT_RPL_REGISTER_REPLICA: mysql_option = 7027;
pub const mysql_option_MARIADB_OPT_STATUS_CALLBACK: mysql_option = 7028;
pub const mysql_option_MARIADB_OPT_SERVER_PLUGINS: mysql_option = 7029;
pub const mysql_option_MARIADB_OPT_BULK_UNIT_RESULTS: mysql_option = 7030;
pub const mysql_option_MARIADB_OPT_TLS_VERIFICATION_CALLBACK: mysql_option = 7031;
pub type mysql_option = ::std::os::raw::c_uint;
pub const mariadb_value_MARIADB_CHARSET_ID: mariadb_value = 0;
pub const mariadb_value_MARIADB_CHARSET_NAME: mariadb_value = 1;
pub const mariadb_value_MARIADB_CLIENT_ERRORS: mariadb_value = 2;
pub const mariadb_value_MARIADB_CLIENT_VERSION: mariadb_value = 3;
pub const mariadb_value_MARIADB_CLIENT_VERSION_ID: mariadb_value = 4;
pub const mariadb_value_MARIADB_CONNECTION_ASYNC_TIMEOUT: mariadb_value = 5;
pub const mariadb_value_MARIADB_CONNECTION_ASYNC_TIMEOUT_MS: mariadb_value = 6;
pub const mariadb_value_MARIADB_CONNECTION_MARIADB_CHARSET_INFO: mariadb_value = 7;
pub const mariadb_value_MARIADB_CONNECTION_ERROR: mariadb_value = 8;
pub const mariadb_value_MARIADB_CONNECTION_ERROR_ID: mariadb_value = 9;
pub const mariadb_value_MARIADB_CONNECTION_HOST: mariadb_value = 10;
pub const mariadb_value_MARIADB_CONNECTION_INFO: mariadb_value = 11;
pub const mariadb_value_MARIADB_CONNECTION_PORT: mariadb_value = 12;
pub const mariadb_value_MARIADB_CONNECTION_PROTOCOL_VERSION_ID: mariadb_value = 13;
pub const mariadb_value_MARIADB_CONNECTION_PVIO_TYPE: mariadb_value = 14;
pub const mariadb_value_MARIADB_CONNECTION_SCHEMA: mariadb_value = 15;
pub const mariadb_value_MARIADB_CONNECTION_SERVER_TYPE: mariadb_value = 16;
pub const mariadb_value_MARIADB_CONNECTION_SERVER_VERSION: mariadb_value = 17;
pub const mariadb_value_MARIADB_CONNECTION_SERVER_VERSION_ID: mariadb_value = 18;
pub const mariadb_value_MARIADB_CONNECTION_SOCKET: mariadb_value = 19;
pub const mariadb_value_MARIADB_CONNECTION_SQLSTATE: mariadb_value = 20;
pub const mariadb_value_MARIADB_CONNECTION_SSL_CIPHER: mariadb_value = 21;
pub const mariadb_value_MARIADB_TLS_LIBRARY: mariadb_value = 22;
pub const mariadb_value_MARIADB_CONNECTION_TLS_VERSION: mariadb_value = 23;
pub const mariadb_value_MARIADB_CONNECTION_TLS_VERSION_ID: mariadb_value = 24;
pub const mariadb_value_MARIADB_CONNECTION_TYPE: mariadb_value = 25;
pub const mariadb_value_MARIADB_CONNECTION_UNIX_SOCKET: mariadb_value = 26;
pub const mariadb_value_MARIADB_CONNECTION_USER: mariadb_value = 27;
pub const mariadb_value_MARIADB_MAX_ALLOWED_PACKET: mariadb_value = 28;
pub const mariadb_value_MARIADB_NET_BUFFER_LENGTH: mariadb_value = 29;
pub const mariadb_value_MARIADB_CONNECTION_SERVER_STATUS: mariadb_value = 30;
pub const mariadb_value_MARIADB_CONNECTION_SERVER_CAPABILITIES: mariadb_value = 31;
pub const mariadb_value_MARIADB_CONNECTION_EXTENDED_SERVER_CAPABILITIES: mariadb_value = 32;
pub const mariadb_value_MARIADB_CONNECTION_CLIENT_CAPABILITIES: mariadb_value = 33;
pub const mariadb_value_MARIADB_CONNECTION_BYTES_READ: mariadb_value = 34;
pub const mariadb_value_MARIADB_CONNECTION_BYTES_SENT: mariadb_value = 35;
pub const mariadb_value_MARIADB_TLS_PEER_CERT_INFO: mariadb_value = 36;
pub const mariadb_value_MARIADB_TLS_VERIFY_STATUS: mariadb_value = 37;
pub type mariadb_value = ::std::os::raw::c_uint;
pub const mysql_status_MYSQL_STATUS_READY: mysql_status = 0;
pub const mysql_status_MYSQL_STATUS_GET_RESULT: mysql_status = 1;
pub const mysql_status_MYSQL_STATUS_USE_RESULT: mysql_status = 2;
pub const mysql_status_MYSQL_STATUS_QUERY_SENT: mysql_status = 3;
pub const mysql_status_MYSQL_STATUS_SENDING_LOAD_DATA: mysql_status = 4;
pub const mysql_status_MYSQL_STATUS_FETCHING_DATA: mysql_status = 5;
pub const mysql_status_MYSQL_STATUS_NEXT_RESULT_PENDING: mysql_status = 6;
pub const mysql_status_MYSQL_STATUS_QUIT_SENT: mysql_status = 7;
pub const mysql_status_MYSQL_STATUS_STMT_RESULT: mysql_status = 8;
pub type mysql_status = ::std::os::raw::c_uint;
pub const mysql_protocol_type_MYSQL_PROTOCOL_DEFAULT: mysql_protocol_type = 0;
pub const mysql_protocol_type_MYSQL_PROTOCOL_TCP: mysql_protocol_type = 1;
pub const mysql_protocol_type_MYSQL_PROTOCOL_SOCKET: mysql_protocol_type = 2;
pub const mysql_protocol_type_MYSQL_PROTOCOL_PIPE: mysql_protocol_type = 3;
pub const mysql_protocol_type_MYSQL_PROTOCOL_MEMORY: mysql_protocol_type = 4;
pub type mysql_protocol_type = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct st_mysql_options {
    pub connect_timeout: ::std::os::raw::c_uint,
    pub read_timeout: ::std::os::raw::c_uint,
    pub write_timeout: ::std::os::raw::c_uint,
    pub port: ::std::os::raw::c_uint,
    pub protocol: ::std::os::raw::c_uint,
    pub client_flag: ::std::os::raw::c_ulong,
    pub host: *mut ::std::os::raw::c_char,
    pub user: *mut ::std::os::raw::c_char,
    pub password: *mut ::std::os::raw::c_char,
    pub unix_socket: *mut ::std::os::raw::c_char,
    pub db: *mut ::std::os::raw::c_char,
    pub init_command: *mut st_dynamic_array,
    pub my_cnf_file: *mut ::std::os::raw::c_char,
    pub my_cnf_group: *mut ::std::os::raw::c_char,
    pub charset_dir: *mut ::std::os::raw::c_char,
    pub charset_name: *mut ::std::os::raw::c_char,
    pub ssl_key: *mut ::std::os::raw::c_char,
    pub ssl_cert: *mut ::std::os::raw::c_char,
    pub ssl_ca: *mut ::std::os::raw::c_char,
    pub ssl_capath: *mut ::std::os::raw::c_char,
    pub ssl_cipher: *mut ::std::os::raw::c_char,
    pub shared_memory_base_name: *mut ::std::os::raw::c_char,
    pub max_allowed_packet: ::std::os::raw::c_ulong,
    pub use_ssl: my_bool,
    pub compress: my_bool,
    pub named_pipe: my_bool,
    pub reconnect: my_bool,
    pub unused_1: my_bool,
    pub unused_2: my_bool,
    pub unused_3: my_bool,
    pub methods_to_use: mysql_option,
    pub bind_address: *mut ::std::os::raw::c_char,
    pub secure_auth: my_bool,
    pub report_data_truncation: my_bool,
    pub local_infile_init: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut *mut ::std::os::raw::c_void,
            arg2: *const ::std::os::raw::c_char,
            arg3: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >,
    pub local_infile_read: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *mut ::std::os::raw::c_char,
            arg3: ::std::os::raw::c_uint,
        ) -> ::std::os::raw::c_int,
    >,
    pub local_infile_end:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub local_infile_error: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *mut ::std::os::raw::c_char,
            arg3: ::std::os::raw::c_uint,
        ) -> ::std::os::raw::c_int,
    >,
    pub local_infile_userdata: *mut ::std::os::raw::c_void,
    pub extension: *mut st_mysql_options_extension,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of st_mysql_options"][::std::mem::size_of::<st_mysql_options>() - 248usize];
    ["Alignment of st_mysql_options"][::std::mem::align_of::<st_mysql_options>() - 8usize];
    ["Offset of field: st_mysql_options::connect_timeout"]
        [::std::mem::offset_of!(st_mysql_options, connect_timeout) - 0usize];
    ["Offset of field: st_mysql_options::read_timeout"]
        [::std::mem::offset_of!(st_mysql_options, read_timeout) - 4usize];
    ["Offset of field: st_mysql_options::write_timeout"]
        [::std::mem::offset_of!(st_mysql_options, write_timeout) - 8usize];
    ["Offset of field: st_mysql_options::port"]
        [::std::mem::offset_of!(st_mysql_options, port) - 12usize];
    ["Offset of field: st_mysql_options::protocol"]
        [::std::mem::offset_of!(st_mysql_options, protocol) - 16usize];
    ["Offset of field: st_mysql_options::client_flag"]
        [::std::mem::offset_of!(st_mysql_options, client_flag) - 24usize];
    ["Offset of field: st_mysql_options::host"]
        [::std::mem::offset_of!(st_mysql_options, host) - 32usize];
    ["Offset of field: st_mysql_options::user"]
        [::std::mem::offset_of!(st_mysql_options, user) - 40usize];
    ["Offset of field: st_mysql_options::password"]
        [::std::mem::offset_of!(st_mysql_options, password) - 48usize];
    ["Offset of field: st_mysql_options::unix_socket"]
        [::std::mem::offset_of!(st_mysql_options, unix_socket) - 56usize];
    ["Offset of field: st_mysql_options::db"]
        [::std::mem::offset_of!(st_mysql_options, db) - 64usize];
    ["Offset of field: st_mysql_options::init_command"]
        [::std::mem::offset_of!(st_mysql_options, init_command) - 72usize];
    ["Offset of field: st_mysql_options::my_cnf_file"]
        [::std::mem::offset_of!(st_mysql_options, my_cnf_file) - 80usize];
    ["Offset of field: st_mysql_options::my_cnf_group"]
        [::std::mem::offset_of!(st_mysql_options, my_cnf_group) - 88usize];
    ["Offset of field: st_mysql_options::charset_dir"]
        [::std::mem::offset_of!(st_mysql_options, charset_dir) - 96usize];
    ["Offset of field: st_mysql_options::charset_name"]
        [::std::mem::offset_of!(st_mysql_options, charset_name) - 104usize];
    ["Offset of field: st_mysql_options::ssl_key"]
        [::std::mem::offset_of!(st_mysql_options, ssl_key) - 112usize];
    ["Offset of field: st_mysql_options::ssl_cert"]
        [::std::mem::offset_of!(st_mysql_options, ssl_cert) - 120usize];
    ["Offset of field: st_mysql_options::ssl_ca"]
        [::std::mem::offset_of!(st_mysql_options, ssl_ca) - 128usize];
    ["Offset of field: st_mysql_options::ssl_capath"]
        [::std::mem::offset_of!(st_mysql_options, ssl_capath) - 136usize];
    ["Offset of field: st_mysql_options::ssl_cipher"]
        [::std::mem::offset_of!(st_mysql_options, ssl_cipher) - 144usize];
    ["Offset of field: st_mysql_options::shared_memory_base_name"]
        [::std::mem::offset_of!(st_mysql_options, shared_memory_base_name) - 152usize];
    ["Offset of field: st_mysql_options::max_allowed_packet"]
        [::std::mem::offset_of!(st_mysql_options, max_allowed_packet) - 160usize];
    ["Offset of field: st_mysql_options::use_ssl"]
        [::std::mem::offset_of!(st_mysql_options, use_ssl) - 168usize];
    ["Offset of field: st_mysql_options::compress"]
        [::std::mem::offset_of!(st_mysql_options, compress) - 169usize];
    ["Offset of field: st_mysql_options::named_pipe"]
        [::std::mem::offset_of!(st_mysql_options, named_pipe) - 170usize];
    ["Offset of field: st_mysql_options::reconnect"]
        [::std::mem::offset_of!(st_mysql_options, reconnect) - 171usize];
    ["Offset of field: st_mysql_options::unused_1"]
        [::std::mem::offset_of!(st_mysql_options, unused_1) - 172usize];
    ["Offset of field: st_mysql_options::unused_2"]
        [::std::mem::offset_of!(st_mysql_options, unused_2) - 173usize];
    ["Offset of field: st_mysql_options::unused_3"]
        [::std::mem::offset_of!(st_mysql_options, unused_3) - 174usize];
    ["Offset of field: st_mysql_options::methods_to_use"]
        [::std::mem::offset_of!(st_mysql_options, methods_to_use) - 176usize];
    ["Offset of field: st_mysql_options::bind_address"]
        [::std::mem::offset_of!(st_mysql_options, bind_address) - 184usize];
    ["Offset of field: st_mysql_options::secure_auth"]
        [::std::mem::offset_of!(st_mysql_options, secure_auth) - 192usize];
    ["Offset of field: st_mysql_options::report_data_truncation"]
        [::std::mem::offset_of!(st_mysql_options, report_data_truncation) - 193usize];
    ["Offset of field: st_mysql_options::local_infile_init"]
        [::std::mem::offset_of!(st_mysql_options, local_infile_init) - 200usize];
    ["Offset of field: st_mysql_options::local_infile_read"]
        [::std::mem::offset_of!(st_mysql_options, local_infile_read) - 208usize];
    ["Offset of field: st_mysql_options::local_infile_end"]
        [::std::mem::offset_of!(st_mysql_options, local_infile_end) - 216usize];
    ["Offset of field: st_mysql_options::local_infile_error"]
        [::std::mem::offset_of!(st_mysql_options, local_infile_error) - 224usize];
    ["Offset of field: st_mysql_options::local_infile_userdata"]
        [::std::mem::offset_of!(st_mysql_options, local_infile_userdata) - 232usize];
    ["Offset of field: st_mysql_options::extension"]
        [::std::mem::offset_of!(st_mysql_options, extension) - 240usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct st_mysql {
    pub net: NET,
    pub unused_0: *mut ::std::os::raw::c_void,
    pub host: *mut ::std::os::raw::c_char,
    pub user: *mut ::std::os::raw::c_char,
    pub passwd: *mut ::std::os::raw::c_char,
    pub unix_socket: *mut ::std::os::raw::c_char,
    pub server_version: *mut ::std::os::raw::c_char,
    pub host_info: *mut ::std::os::raw::c_char,
    pub info: *mut ::std::os::raw::c_char,
    pub db: *mut ::std::os::raw::c_char,
    pub charset: *const ma_charset_info_st,
    pub fields: *mut MYSQL_FIELD,
    pub field_alloc: MA_MEM_ROOT,
    pub affected_rows: ::std::os::raw::c_ulonglong,
    pub insert_id: ::std::os::raw::c_ulonglong,
    pub extra_info: ::std::os::raw::c_ulonglong,
    pub thread_id: ::std::os::raw::c_ulong,
    pub packet_length: ::std::os::raw::c_ulong,
    pub port: ::std::os::raw::c_uint,
    pub client_flag: ::std::os::raw::c_ulong,
    pub server_capabilities: ::std::os::raw::c_ulong,
    pub protocol_version: ::std::os::raw::c_uint,
    pub field_count: ::std::os::raw::c_uint,
    pub server_status: ::std::os::raw::c_uint,
    pub server_language: ::std::os::raw::c_uint,
    pub warning_count: ::std::os::raw::c_uint,
    pub options: st_mysql_options,
    pub status: mysql_status,
    pub free_me: my_bool,
    pub unused_1: my_bool,
    pub scramble_buff: [::std::os::raw::c_char; 21usize],
    pub unused_2: my_bool,
    pub unused_3: *mut ::std::os::raw::c_void,
    pub unused_4: *mut ::std::os::raw::c_void,
    pub unused_5: *mut ::std::os::raw::c_void,
    pub unused_6: *mut ::std::os::raw::c_void,
    pub stmts: *mut LIST,
    pub methods: *const st_mariadb_methods,
    pub thd: *mut ::std::os::raw::c_void,
    pub unbuffered_fetch_owner: *mut my_bool,
    pub info_buffer: *mut ::std::os::raw::c_char,
    pub extension: *mut st_mariadb_extension,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of st_mysql"][::std::mem::size_of::<st_mysql>() - 1272usize];
    ["Alignment of st_mysql"][::std::mem::align_of::<st_mysql>() - 8usize];
    ["Offset of field: st_mysql::net"][::std::mem::offset_of!(st_mysql, net) - 0usize];
    ["Offset of field: st_mysql::unused_0"][::std::mem::offset_of!(st_mysql, unused_0) - 680usize];
    ["Offset of field: st_mysql::host"][::std::mem::offset_of!(st_mysql, host) - 688usize];
    ["Offset of field: st_mysql::user"][::std::mem::offset_of!(st_mysql, user) - 696usize];
    ["Offset of field: st_mysql::passwd"][::std::mem::offset_of!(st_mysql, passwd) - 704usize];
    ["Offset of field: st_mysql::unix_socket"]
        [::std::mem::offset_of!(st_mysql, unix_socket) - 712usize];
    ["Offset of field: st_mysql::server_version"]
        [::std::mem::offset_of!(st_mysql, server_version) - 720usize];
    ["Offset of field: st_mysql::host_info"]
        [::std::mem::offset_of!(st_mysql, host_info) - 728usize];
    ["Offset of field: st_mysql::info"][::std::mem::offset_of!(st_mysql, info) - 736usize];
    ["Offset of field: st_mysql::db"][::std::mem::offset_of!(st_mysql, db) - 744usize];
    ["Offset of field: st_mysql::charset"][::std::mem::offset_of!(st_mysql, charset) - 752usize];
    ["Offset of field: st_mysql::fields"][::std::mem::offset_of!(st_mysql, fields) - 760usize];
    ["Offset of field: st_mysql::field_alloc"]
        [::std::mem::offset_of!(st_mysql, field_alloc) - 768usize];
    ["Offset of field: st_mysql::affected_rows"]
        [::std::mem::offset_of!(st_mysql, affected_rows) - 824usize];
    ["Offset of field: st_mysql::insert_id"]
        [::std::mem::offset_of!(st_mysql, insert_id) - 832usize];
    ["Offset of field: st_mysql::extra_info"]
        [::std::mem::offset_of!(st_mysql, extra_info) - 840usize];
    ["Offset of field: st_mysql::thread_id"]
        [::std::mem::offset_of!(st_mysql, thread_id) - 848usize];
    ["Offset of field: st_mysql::packet_length"]
        [::std::mem::offset_of!(st_mysql, packet_length) - 856usize];
    ["Offset of field: st_mysql::port"][::std::mem::offset_of!(st_mysql, port) - 864usize];
    ["Offset of field: st_mysql::client_flag"]
        [::std::mem::offset_of!(st_mysql, client_flag) - 872usize];
    ["Offset of field: st_mysql::server_capabilities"]
        [::std::mem::offset_of!(st_mysql, server_capabilities) - 880usize];
    ["Offset of field: st_mysql::protocol_version"]
        [::std::mem::offset_of!(st_mysql, protocol_version) - 888usize];
    ["Offset of field: st_mysql::field_count"]
        [::std::mem::offset_of!(st_mysql, field_count) - 892usize];
    ["Offset of field: st_mysql::server_status"]
        [::std::mem::offset_of!(st_mysql, server_status) - 896usize];
    ["Offset of field: st_mysql::server_language"]
        [::std::mem::offset_of!(st_mysql, server_language) - 900usize];
    ["Offset of field: st_mysql::warning_count"]
        [::std::mem::offset_of!(st_mysql, warning_count) - 904usize];
    ["Offset of field: st_mysql::options"][::std::mem::offset_of!(st_mysql, options) - 912usize];
    ["Offset of field: st_mysql::status"][::std::mem::offset_of!(st_mysql, status) - 1160usize];
    ["Offset of field: st_mysql::free_me"][::std::mem::offset_of!(st_mysql, free_me) - 1164usize];
    ["Offset of field: st_mysql::unused_1"][::std::mem::offset_of!(st_mysql, unused_1) - 1165usize];
    ["Offset of field: st_mysql::scramble_buff"]
        [::std::mem::offset_of!(st_mysql, scramble_buff) - 1166usize];
    ["Offset of field: st_mysql::unused_2"][::std::mem::offset_of!(st_mysql, unused_2) - 1187usize];
    ["Offset of field: st_mysql::unused_3"][::std::mem::offset_of!(st_mysql, unused_3) - 1192usize];
    ["Offset of field: st_mysql::unused_4"][::std::mem::offset_of!(st_mysql, unused_4) - 1200usize];
    ["Offset of field: st_mysql::unused_5"][::std::mem::offset_of!(st_mysql, unused_5) - 1208usize];
    ["Offset of field: st_mysql::unused_6"][::std::mem::offset_of!(st_mysql, unused_6) - 1216usize];
    ["Offset of field: st_mysql::stmts"][::std::mem::offset_of!(st_mysql, stmts) - 1224usize];
    ["Offset of field: st_mysql::methods"][::std::mem::offset_of!(st_mysql, methods) - 1232usize];
    ["Offset of field: st_mysql::thd"][::std::mem::offset_of!(st_mysql, thd) - 1240usize];
    ["Offset of field: st_mysql::unbuffered_fetch_owner"]
        [::std::mem::offset_of!(st_mysql, unbuffered_fetch_owner) - 1248usize];
    ["Offset of field: st_mysql::info_buffer"]
        [::std::mem::offset_of!(st_mysql, info_buffer) - 1256usize];
    ["Offset of field: st_mysql::extension"]
        [::std::mem::offset_of!(st_mysql, extension) - 1264usize];
};
pub type MYSQL = st_mysql;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct st_mysql_res {
    pub row_count: ::std::os::raw::c_ulonglong,
    pub field_count: ::std::os::raw::c_uint,
    pub current_field: ::std::os::raw::c_uint,
    pub fields: *mut MYSQL_FIELD,
    pub data: *mut MYSQL_DATA,
    pub data_cursor: *mut MYSQL_ROWS,
    pub field_alloc: MA_MEM_ROOT,
    pub row: MYSQL_ROW,
    pub current_row: MYSQL_ROW,
    pub lengths: *mut ::std::os::raw::c_ulong,
    pub handle: *mut MYSQL,
    pub eof: my_bool,
    pub is_ps: my_bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of st_mysql_res"][::std::mem::size_of::<st_mysql_res>() - 136usize];
    ["Alignment of st_mysql_res"][::std::mem::align_of::<st_mysql_res>() - 8usize];
    ["Offset of field: st_mysql_res::row_count"]
        [::std::mem::offset_of!(st_mysql_res, row_count) - 0usize];
    ["Offset of field: st_mysql_res::field_count"]
        [::std::mem::offset_of!(st_mysql_res, field_count) - 8usize];
    ["Offset of field: st_mysql_res::current_field"]
        [::std::mem::offset_of!(st_mysql_res, current_field) - 12usize];
    ["Offset of field: st_mysql_res::fields"]
        [::std::mem::offset_of!(st_mysql_res, fields) - 16usize];
    ["Offset of field: st_mysql_res::data"][::std::mem::offset_of!(st_mysql_res, data) - 24usize];
    ["Offset of field: st_mysql_res::data_cursor"]
        [::std::mem::offset_of!(st_mysql_res, data_cursor) - 32usize];
    ["Offset of field: st_mysql_res::field_alloc"]
        [::std::mem::offset_of!(st_mysql_res, field_alloc) - 40usize];
    ["Offset of field: st_mysql_res::row"][::std::mem::offset_of!(st_mysql_res, row) - 96usize];
    ["Offset of field: st_mysql_res::current_row"]
        [::std::mem::offset_of!(st_mysql_res, current_row) - 104usize];
    ["Offset of field: st_mysql_res::lengths"]
        [::std::mem::offset_of!(st_mysql_res, lengths) - 112usize];
    ["Offset of field: st_mysql_res::handle"]
        [::std::mem::offset_of!(st_mysql_res, handle) - 120usize];
    ["Offset of field: st_mysql_res::eof"][::std::mem::offset_of!(st_mysql_res, eof) - 128usize];
    ["Offset of field: st_mysql_res::is_ps"]
        [::std::mem::offset_of!(st_mysql_res, is_ps) - 129usize];
};
pub type MYSQL_RES = st_mysql_res;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MYSQL_PARAMETERS {
    pub p_max_allowed_packet: *mut ::std::os::raw::c_ulong,
    pub p_net_buffer_length: *mut ::std::os::raw::c_ulong,
    pub extension: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MYSQL_PARAMETERS"][::std::mem::size_of::<MYSQL_PARAMETERS>() - 24usize];
    ["Alignment of MYSQL_PARAMETERS"][::std::mem::align_of::<MYSQL_PARAMETERS>() - 8usize];
    ["Offset of field: MYSQL_PARAMETERS::p_max_allowed_packet"]
        [::std::mem::offset_of!(MYSQL_PARAMETERS, p_max_allowed_packet) - 0usize];
    ["Offset of field: MYSQL_PARAMETERS::p_net_buffer_length"]
        [::std::mem::offset_of!(MYSQL_PARAMETERS, p_net_buffer_length) - 8usize];
    ["Offset of field: MYSQL_PARAMETERS::extension"]
        [::std::mem::offset_of!(MYSQL_PARAMETERS, extension) - 16usize];
};
pub const mariadb_field_attr_t_MARIADB_FIELD_ATTR_DATA_TYPE_NAME: mariadb_field_attr_t = 0;
pub const mariadb_field_attr_t_MARIADB_FIELD_ATTR_FORMAT_NAME: mariadb_field_attr_t = 1;
pub type mariadb_field_attr_t = ::std::os::raw::c_uint;
unsafe extern "C" {
    pub fn mariadb_field_attr(
        attr: *mut MARIADB_CONST_STRING,
        field: *const MYSQL_FIELD,
        type_: mariadb_field_attr_t,
    ) -> ::std::os::raw::c_int;
}
pub const enum_mysql_timestamp_type_MYSQL_TIMESTAMP_NONE: enum_mysql_timestamp_type = -2;
pub const enum_mysql_timestamp_type_MYSQL_TIMESTAMP_ERROR: enum_mysql_timestamp_type = -1;
pub const enum_mysql_timestamp_type_MYSQL_TIMESTAMP_DATE: enum_mysql_timestamp_type = 0;
pub const enum_mysql_timestamp_type_MYSQL_TIMESTAMP_DATETIME: enum_mysql_timestamp_type = 1;
pub const enum_mysql_timestamp_type_MYSQL_TIMESTAMP_TIME: enum_mysql_timestamp_type = 2;
pub type enum_mysql_timestamp_type = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct st_mysql_time {
    pub year: ::std::os::raw::c_uint,
    pub month: ::std::os::raw::c_uint,
    pub day: ::std::os::raw::c_uint,
    pub hour: ::std::os::raw::c_uint,
    pub minute: ::std::os::raw::c_uint,
    pub second: ::std::os::raw::c_uint,
    pub second_part: ::std::os::raw::c_ulong,
    pub neg: my_bool,
    pub time_type: enum_mysql_timestamp_type,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of st_mysql_time"][::std::mem::size_of::<st_mysql_time>() - 40usize];
    ["Alignment of st_mysql_time"][::std::mem::align_of::<st_mysql_time>() - 8usize];
    ["Offset of field: st_mysql_time::year"][::std::mem::offset_of!(st_mysql_time, year) - 0usize];
    ["Offset of field: st_mysql_time::month"]
        [::std::mem::offset_of!(st_mysql_time, month) - 4usize];
    ["Offset of field: st_mysql_time::day"][::std::mem::offset_of!(st_mysql_time, day) - 8usize];
    ["Offset of field: st_mysql_time::hour"][::std::mem::offset_of!(st_mysql_time, hour) - 12usize];
    ["Offset of field: st_mysql_time::minute"]
        [::std::mem::offset_of!(st_mysql_time, minute) - 16usize];
    ["Offset of field: st_mysql_time::second"]
        [::std::mem::offset_of!(st_mysql_time, second) - 20usize];
    ["Offset of field: st_mysql_time::second_part"]
        [::std::mem::offset_of!(st_mysql_time, second_part) - 24usize];
    ["Offset of field: st_mysql_time::neg"][::std::mem::offset_of!(st_mysql_time, neg) - 32usize];
    ["Offset of field: st_mysql_time::time_type"]
        [::std::mem::offset_of!(st_mysql_time, time_type) - 36usize];
};
pub type MYSQL_TIME = st_mysql_time;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct character_set {
    pub number: ::std::os::raw::c_uint,
    pub state: ::std::os::raw::c_uint,
    pub csname: *const ::std::os::raw::c_char,
    pub name: *const ::std::os::raw::c_char,
    pub comment: *const ::std::os::raw::c_char,
    pub dir: *const ::std::os::raw::c_char,
    pub mbminlen: ::std::os::raw::c_uint,
    pub mbmaxlen: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of character_set"][::std::mem::size_of::<character_set>() - 48usize];
    ["Alignment of character_set"][::std::mem::align_of::<character_set>() - 8usize];
    ["Offset of field: character_set::number"]
        [::std::mem::offset_of!(character_set, number) - 0usize];
    ["Offset of field: character_set::state"]
        [::std::mem::offset_of!(character_set, state) - 4usize];
    ["Offset of field: character_set::csname"]
        [::std::mem::offset_of!(character_set, csname) - 8usize];
    ["Offset of field: character_set::name"][::std::mem::offset_of!(character_set, name) - 16usize];
    ["Offset of field: character_set::comment"]
        [::std::mem::offset_of!(character_set, comment) - 24usize];
    ["Offset of field: character_set::dir"][::std::mem::offset_of!(character_set, dir) - 32usize];
    ["Offset of field: character_set::mbminlen"]
        [::std::mem::offset_of!(character_set, mbminlen) - 40usize];
    ["Offset of field: character_set::mbmaxlen"]
        [::std::mem::offset_of!(character_set, mbmaxlen) - 44usize];
};
pub type MY_CHARSET_INFO = character_set;
pub type MYSQL_STMT = st_mysql_stmt;
pub type mysql_stmt_use_or_store_func =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut MYSQL_STMT) -> *mut MYSQL_RES>;
pub const enum_stmt_attr_type_STMT_ATTR_UPDATE_MAX_LENGTH: enum_stmt_attr_type = 0;
pub const enum_stmt_attr_type_STMT_ATTR_CURSOR_TYPE: enum_stmt_attr_type = 1;
pub const enum_stmt_attr_type_STMT_ATTR_PREFETCH_ROWS: enum_stmt_attr_type = 2;
pub const enum_stmt_attr_type_STMT_ATTR_PREBIND_PARAMS: enum_stmt_attr_type = 200;
pub const enum_stmt_attr_type_STMT_ATTR_ARRAY_SIZE: enum_stmt_attr_type = 201;
pub const enum_stmt_attr_type_STMT_ATTR_ROW_SIZE: enum_stmt_attr_type = 202;
pub const enum_stmt_attr_type_STMT_ATTR_STATE: enum_stmt_attr_type = 203;
pub const enum_stmt_attr_type_STMT_ATTR_CB_USER_DATA: enum_stmt_attr_type = 204;
pub const enum_stmt_attr_type_STMT_ATTR_CB_PARAM: enum_stmt_attr_type = 205;
pub const enum_stmt_attr_type_STMT_ATTR_CB_RESULT: enum_stmt_attr_type = 206;
pub const enum_stmt_attr_type_STMT_ATTR_SQL_STATEMENT: enum_stmt_attr_type = 207;
pub type enum_stmt_attr_type = ::std::os::raw::c_uint;
pub const enum_cursor_type_CURSOR_TYPE_NO_CURSOR: enum_cursor_type = 0;
pub const enum_cursor_type_CURSOR_TYPE_READ_ONLY: enum_cursor_type = 1;
pub const enum_cursor_type_CURSOR_TYPE_FOR_UPDATE: enum_cursor_type = 2;
pub const enum_cursor_type_CURSOR_TYPE_SCROLLABLE: enum_cursor_type = 4;
pub type enum_cursor_type = ::std::os::raw::c_uint;
pub const enum_indicator_type_STMT_INDICATOR_NTS: enum_indicator_type = -1;
pub const enum_indicator_type_STMT_INDICATOR_NONE: enum_indicator_type = 0;
pub const enum_indicator_type_STMT_INDICATOR_NULL: enum_indicator_type = 1;
pub const enum_indicator_type_STMT_INDICATOR_DEFAULT: enum_indicator_type = 2;
pub const enum_indicator_type_STMT_INDICATOR_IGNORE: enum_indicator_type = 3;
pub const enum_indicator_type_STMT_INDICATOR_IGNORE_ROW: enum_indicator_type = 4;
pub type enum_indicator_type = ::std::os::raw::c_int;
pub const mysql_stmt_state_MYSQL_STMT_INITTED: mysql_stmt_state = 0;
pub const mysql_stmt_state_MYSQL_STMT_PREPARED: mysql_stmt_state = 1;
pub const mysql_stmt_state_MYSQL_STMT_EXECUTED: mysql_stmt_state = 2;
pub const mysql_stmt_state_MYSQL_STMT_WAITING_USE_OR_STORE: mysql_stmt_state = 3;
pub const mysql_stmt_state_MYSQL_STMT_USE_OR_STORE_CALLED: mysql_stmt_state = 4;
pub const mysql_stmt_state_MYSQL_STMT_USER_FETCHING: mysql_stmt_state = 5;
pub const mysql_stmt_state_MYSQL_STMT_FETCH_DONE: mysql_stmt_state = 6;
pub type mysql_stmt_state = ::std::os::raw::c_uint;
pub use self::mysql_stmt_state as enum_mysqlnd_stmt_state;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct st_mysql_bind {
    pub length: *mut ::std::os::raw::c_ulong,
    pub is_null: *mut my_bool,
    pub buffer: *mut ::std::os::raw::c_void,
    pub error: *mut my_bool,
    pub u: st_mysql_bind__bindgen_ty_1,
    pub store_param_func:
        ::std::option::Option<unsafe extern "C" fn(net: *mut NET, param: *mut st_mysql_bind)>,
    pub fetch_result: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut st_mysql_bind,
            arg2: *mut MYSQL_FIELD,
            row: *mut *mut ::std::os::raw::c_uchar,
        ),
    >,
    pub skip_result: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut st_mysql_bind,
            arg2: *mut MYSQL_FIELD,
            row: *mut *mut ::std::os::raw::c_uchar,
        ),
    >,
    pub buffer_length: ::std::os::raw::c_ulong,
    pub offset: ::std::os::raw::c_ulong,
    pub length_value: ::std::os::raw::c_ulong,
    pub flags: ::std::os::raw::c_uint,
    pub pack_length: ::std::os::raw::c_uint,
    pub buffer_type: enum_field_types,
    pub error_value: my_bool,
    pub is_unsigned: my_bool,
    pub long_data_used: my_bool,
    pub is_null_value: my_bool,
    pub extension: *mut ::std::os::raw::c_void,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union st_mysql_bind__bindgen_ty_1 {
    pub row_ptr: *mut ::std::os::raw::c_uchar,
    pub indicator: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of st_mysql_bind__bindgen_ty_1"]
        [::std::mem::size_of::<st_mysql_bind__bindgen_ty_1>() - 8usize];
    ["Alignment of st_mysql_bind__bindgen_ty_1"]
        [::std::mem::align_of::<st_mysql_bind__bindgen_ty_1>() - 8usize];
    ["Offset of field: st_mysql_bind__bindgen_ty_1::row_ptr"]
        [::std::mem::offset_of!(st_mysql_bind__bindgen_ty_1, row_ptr) - 0usize];
    ["Offset of field: st_mysql_bind__bindgen_ty_1::indicator"]
        [::std::mem::offset_of!(st_mysql_bind__bindgen_ty_1, indicator) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of st_mysql_bind"][::std::mem::size_of::<st_mysql_bind>() - 112usize];
    ["Alignment of st_mysql_bind"][::std::mem::align_of::<st_mysql_bind>() - 8usize];
    ["Offset of field: st_mysql_bind::length"]
        [::std::mem::offset_of!(st_mysql_bind, length) - 0usize];
    ["Offset of field: st_mysql_bind::is_null"]
        [::std::mem::offset_of!(st_mysql_bind, is_null) - 8usize];
    ["Offset of field: st_mysql_bind::buffer"]
        [::std::mem::offset_of!(st_mysql_bind, buffer) - 16usize];
    ["Offset of field: st_mysql_bind::error"]
        [::std::mem::offset_of!(st_mysql_bind, error) - 24usize];
    ["Offset of field: st_mysql_bind::u"][::std::mem::offset_of!(st_mysql_bind, u) - 32usize];
    ["Offset of field: st_mysql_bind::store_param_func"]
        [::std::mem::offset_of!(st_mysql_bind, store_param_func) - 40usize];
    ["Offset of field: st_mysql_bind::fetch_result"]
        [::std::mem::offset_of!(st_mysql_bind, fetch_result) - 48usize];
    ["Offset of field: st_mysql_bind::skip_result"]
        [::std::mem::offset_of!(st_mysql_bind, skip_result) - 56usize];
    ["Offset of field: st_mysql_bind::buffer_length"]
        [::std::mem::offset_of!(st_mysql_bind, buffer_length) - 64usize];
    ["Offset of field: st_mysql_bind::offset"]
        [::std::mem::offset_of!(st_mysql_bind, offset) - 72usize];
    ["Offset of field: st_mysql_bind::length_value"]
        [::std::mem::offset_of!(st_mysql_bind, length_value) - 80usize];
    ["Offset of field: st_mysql_bind::flags"]
        [::std::mem::offset_of!(st_mysql_bind, flags) - 88usize];
    ["Offset of field: st_mysql_bind::pack_length"]
        [::std::mem::offset_of!(st_mysql_bind, pack_length) - 92usize];
    ["Offset of field: st_mysql_bind::buffer_type"]
        [::std::mem::offset_of!(st_mysql_bind, buffer_type) - 96usize];
    ["Offset of field: st_mysql_bind::error_value"]
        [::std::mem::offset_of!(st_mysql_bind, error_value) - 100usize];
    ["Offset of field: st_mysql_bind::is_unsigned"]
        [::std::mem::offset_of!(st_mysql_bind, is_unsigned) - 101usize];
    ["Offset of field: st_mysql_bind::long_data_used"]
        [::std::mem::offset_of!(st_mysql_bind, long_data_used) - 102usize];
    ["Offset of field: st_mysql_bind::is_null_value"]
        [::std::mem::offset_of!(st_mysql_bind, is_null_value) - 103usize];
    ["Offset of field: st_mysql_bind::extension"]
        [::std::mem::offset_of!(st_mysql_bind, extension) - 104usize];
};
pub type MYSQL_BIND = st_mysql_bind;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct st_mysqlnd_upsert_result {
    pub warning_count: ::std::os::raw::c_uint,
    pub server_status: ::std::os::raw::c_uint,
    pub affected_rows: ::std::os::raw::c_ulonglong,
    pub last_insert_id: ::std::os::raw::c_ulonglong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of st_mysqlnd_upsert_result"]
        [::std::mem::size_of::<st_mysqlnd_upsert_result>() - 24usize];
    ["Alignment of st_mysqlnd_upsert_result"]
        [::std::mem::align_of::<st_mysqlnd_upsert_result>() - 8usize];
    ["Offset of field: st_mysqlnd_upsert_result::warning_count"]
        [::std::mem::offset_of!(st_mysqlnd_upsert_result, warning_count) - 0usize];
    ["Offset of field: st_mysqlnd_upsert_result::server_status"]
        [::std::mem::offset_of!(st_mysqlnd_upsert_result, server_status) - 4usize];
    ["Offset of field: st_mysqlnd_upsert_result::affected_rows"]
        [::std::mem::offset_of!(st_mysqlnd_upsert_result, affected_rows) - 8usize];
    ["Offset of field: st_mysqlnd_upsert_result::last_insert_id"]
        [::std::mem::offset_of!(st_mysqlnd_upsert_result, last_insert_id) - 16usize];
};
pub type mysql_upsert_status = st_mysqlnd_upsert_result;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct st_mysql_cmd_buffer {
    pub buffer: *mut ::std::os::raw::c_uchar,
    pub length: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of st_mysql_cmd_buffer"][::std::mem::size_of::<st_mysql_cmd_buffer>() - 16usize];
    ["Alignment of st_mysql_cmd_buffer"][::std::mem::align_of::<st_mysql_cmd_buffer>() - 8usize];
    ["Offset of field: st_mysql_cmd_buffer::buffer"]
        [::std::mem::offset_of!(st_mysql_cmd_buffer, buffer) - 0usize];
    ["Offset of field: st_mysql_cmd_buffer::length"]
        [::std::mem::offset_of!(st_mysql_cmd_buffer, length) - 8usize];
};
pub type MYSQL_CMD_BUFFER = st_mysql_cmd_buffer;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct st_mysql_error_info {
    pub error_no: ::std::os::raw::c_uint,
    pub error: [::std::os::raw::c_char; 513usize],
    pub sqlstate: [::std::os::raw::c_char; 6usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of st_mysql_error_info"][::std::mem::size_of::<st_mysql_error_info>() - 524usize];
    ["Alignment of st_mysql_error_info"][::std::mem::align_of::<st_mysql_error_info>() - 4usize];
    ["Offset of field: st_mysql_error_info::error_no"]
        [::std::mem::offset_of!(st_mysql_error_info, error_no) - 0usize];
    ["Offset of field: st_mysql_error_info::error"]
        [::std::mem::offset_of!(st_mysql_error_info, error) - 4usize];
    ["Offset of field: st_mysql_error_info::sqlstate"]
        [::std::mem::offset_of!(st_mysql_error_info, sqlstate) - 517usize];
};
pub type mysql_error_info = st_mysql_error_info;
pub type mysql_stmt_fetch_row_func = ::std::option::Option<
    unsafe extern "C" fn(
        stmt: *mut MYSQL_STMT,
        row: *mut *mut ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int,
>;
pub type ps_result_callback = ::std::option::Option<
    unsafe extern "C" fn(
        data: *mut ::std::os::raw::c_void,
        column: ::std::os::raw::c_uint,
        row: *mut *mut ::std::os::raw::c_uchar,
    ),
>;
pub type ps_param_callback = ::std::option::Option<
    unsafe extern "C" fn(
        data: *mut ::std::os::raw::c_void,
        bind: *mut MYSQL_BIND,
        row_nr: ::std::os::raw::c_uint,
    ) -> my_bool,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct st_mysql_stmt {
    pub mem_root: MA_MEM_ROOT,
    pub mysql: *mut MYSQL,
    pub stmt_id: ::std::os::raw::c_ulong,
    pub flags: ::std::os::raw::c_ulong,
    pub state: enum_mysqlnd_stmt_state,
    pub fields: *mut MYSQL_FIELD,
    pub field_count: ::std::os::raw::c_uint,
    pub param_count: ::std::os::raw::c_uint,
    pub send_types_to_server: ::std::os::raw::c_uchar,
    pub params: *mut MYSQL_BIND,
    pub bind: *mut MYSQL_BIND,
    pub result: MYSQL_DATA,
    pub result_cursor: *mut MYSQL_ROWS,
    pub bind_result_done: my_bool,
    pub bind_param_done: my_bool,
    pub upsert_status: mysql_upsert_status,
    pub last_errno: ::std::os::raw::c_uint,
    pub last_error: [::std::os::raw::c_char; 513usize],
    pub sqlstate: [::std::os::raw::c_char; 6usize],
    pub update_max_length: my_bool,
    pub prefetch_rows: ::std::os::raw::c_ulong,
    pub list: LIST,
    pub cursor_exists: my_bool,
    pub extension: *mut ::std::os::raw::c_void,
    pub fetch_row_func: mysql_stmt_fetch_row_func,
    pub execute_count: ::std::os::raw::c_uint,
    pub default_rset_handler: mysql_stmt_use_or_store_func,
    pub request_buffer: *mut ::std::os::raw::c_uchar,
    pub array_size: ::std::os::raw::c_uint,
    pub row_size: usize,
    pub prebind_params: ::std::os::raw::c_uint,
    pub user_data: *mut ::std::os::raw::c_void,
    pub result_callback: ps_result_callback,
    pub param_callback: ps_param_callback,
    pub request_length: usize,
    pub sql: MARIADB_CONST_STRING,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of st_mysql_stmt"][::std::mem::size_of::<st_mysql_stmt>() - 944usize];
    ["Alignment of st_mysql_stmt"][::std::mem::align_of::<st_mysql_stmt>() - 8usize];
    ["Offset of field: st_mysql_stmt::mem_root"]
        [::std::mem::offset_of!(st_mysql_stmt, mem_root) - 0usize];
    ["Offset of field: st_mysql_stmt::mysql"]
        [::std::mem::offset_of!(st_mysql_stmt, mysql) - 56usize];
    ["Offset of field: st_mysql_stmt::stmt_id"]
        [::std::mem::offset_of!(st_mysql_stmt, stmt_id) - 64usize];
    ["Offset of field: st_mysql_stmt::flags"]
        [::std::mem::offset_of!(st_mysql_stmt, flags) - 72usize];
    ["Offset of field: st_mysql_stmt::state"]
        [::std::mem::offset_of!(st_mysql_stmt, state) - 80usize];
    ["Offset of field: st_mysql_stmt::fields"]
        [::std::mem::offset_of!(st_mysql_stmt, fields) - 88usize];
    ["Offset of field: st_mysql_stmt::field_count"]
        [::std::mem::offset_of!(st_mysql_stmt, field_count) - 96usize];
    ["Offset of field: st_mysql_stmt::param_count"]
        [::std::mem::offset_of!(st_mysql_stmt, param_count) - 100usize];
    ["Offset of field: st_mysql_stmt::send_types_to_server"]
        [::std::mem::offset_of!(st_mysql_stmt, send_types_to_server) - 104usize];
    ["Offset of field: st_mysql_stmt::params"]
        [::std::mem::offset_of!(st_mysql_stmt, params) - 112usize];
    ["Offset of field: st_mysql_stmt::bind"]
        [::std::mem::offset_of!(st_mysql_stmt, bind) - 120usize];
    ["Offset of field: st_mysql_stmt::result"]
        [::std::mem::offset_of!(st_mysql_stmt, result) - 128usize];
    ["Offset of field: st_mysql_stmt::result_cursor"]
        [::std::mem::offset_of!(st_mysql_stmt, result_cursor) - 224usize];
    ["Offset of field: st_mysql_stmt::bind_result_done"]
        [::std::mem::offset_of!(st_mysql_stmt, bind_result_done) - 232usize];
    ["Offset of field: st_mysql_stmt::bind_param_done"]
        [::std::mem::offset_of!(st_mysql_stmt, bind_param_done) - 233usize];
    ["Offset of field: st_mysql_stmt::upsert_status"]
        [::std::mem::offset_of!(st_mysql_stmt, upsert_status) - 240usize];
    ["Offset of field: st_mysql_stmt::last_errno"]
        [::std::mem::offset_of!(st_mysql_stmt, last_errno) - 264usize];
    ["Offset of field: st_mysql_stmt::last_error"]
        [::std::mem::offset_of!(st_mysql_stmt, last_error) - 268usize];
    ["Offset of field: st_mysql_stmt::sqlstate"]
        [::std::mem::offset_of!(st_mysql_stmt, sqlstate) - 781usize];
    ["Offset of field: st_mysql_stmt::update_max_length"]
        [::std::mem::offset_of!(st_mysql_stmt, update_max_length) - 787usize];
    ["Offset of field: st_mysql_stmt::prefetch_rows"]
        [::std::mem::offset_of!(st_mysql_stmt, prefetch_rows) - 792usize];
    ["Offset of field: st_mysql_stmt::list"]
        [::std::mem::offset_of!(st_mysql_stmt, list) - 800usize];
    ["Offset of field: st_mysql_stmt::cursor_exists"]
        [::std::mem::offset_of!(st_mysql_stmt, cursor_exists) - 824usize];
    ["Offset of field: st_mysql_stmt::extension"]
        [::std::mem::offset_of!(st_mysql_stmt, extension) - 832usize];
    ["Offset of field: st_mysql_stmt::fetch_row_func"]
        [::std::mem::offset_of!(st_mysql_stmt, fetch_row_func) - 840usize];
    ["Offset of field: st_mysql_stmt::execute_count"]
        [::std::mem::offset_of!(st_mysql_stmt, execute_count) - 848usize];
    ["Offset of field: st_mysql_stmt::default_rset_handler"]
        [::std::mem::offset_of!(st_mysql_stmt, default_rset_handler) - 856usize];
    ["Offset of field: st_mysql_stmt::request_buffer"]
        [::std::mem::offset_of!(st_mysql_stmt, request_buffer) - 864usize];
    ["Offset of field: st_mysql_stmt::array_size"]
        [::std::mem::offset_of!(st_mysql_stmt, array_size) - 872usize];
    ["Offset of field: st_mysql_stmt::row_size"]
        [::std::mem::offset_of!(st_mysql_stmt, row_size) - 880usize];
    ["Offset of field: st_mysql_stmt::prebind_params"]
        [::std::mem::offset_of!(st_mysql_stmt, prebind_params) - 888usize];
    ["Offset of field: st_mysql_stmt::user_data"]
        [::std::mem::offset_of!(st_mysql_stmt, user_data) - 896usize];
    ["Offset of field: st_mysql_stmt::result_callback"]
        [::std::mem::offset_of!(st_mysql_stmt, result_callback) - 904usize];
    ["Offset of field: st_mysql_stmt::param_callback"]
        [::std::mem::offset_of!(st_mysql_stmt, param_callback) - 912usize];
    ["Offset of field: st_mysql_stmt::request_length"]
        [::std::mem::offset_of!(st_mysql_stmt, request_length) - 920usize];
    ["Offset of field: st_mysql_stmt::sql"][::std::mem::offset_of!(st_mysql_stmt, sql) - 928usize];
};
pub type ps_field_fetch_func = ::std::option::Option<
    unsafe extern "C" fn(
        r_param: *mut MYSQL_BIND,
        field: *const MYSQL_FIELD,
        row: *mut *mut ::std::os::raw::c_uchar,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct st_mysql_perm_bind {
    pub func: ps_field_fetch_func,
    pub pack_len: ::std::os::raw::c_int,
    pub max_len: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of st_mysql_perm_bind"][::std::mem::size_of::<st_mysql_perm_bind>() - 24usize];
    ["Alignment of st_mysql_perm_bind"][::std::mem::align_of::<st_mysql_perm_bind>() - 8usize];
    ["Offset of field: st_mysql_perm_bind::func"]
        [::std::mem::offset_of!(st_mysql_perm_bind, func) - 0usize];
    ["Offset of field: st_mysql_perm_bind::pack_len"]
        [::std::mem::offset_of!(st_mysql_perm_bind, pack_len) - 8usize];
    ["Offset of field: st_mysql_perm_bind::max_len"]
        [::std::mem::offset_of!(st_mysql_perm_bind, max_len) - 16usize];
};
pub type MYSQL_PS_CONVERSION = st_mysql_perm_bind;
unsafe extern "C" {
    pub static mut mysql_ps_fetch_functions: [MYSQL_PS_CONVERSION; 256usize];
}
unsafe extern "C" {
    pub fn ma_net_safe_read(mysql: *mut MYSQL) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn mysql_init_ps_subsystem();
}
unsafe extern "C" {
    pub fn net_field_length(packet: *mut *mut ::std::os::raw::c_uchar) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn ma_simple_command(
        mysql: *mut MYSQL,
        command: enum_server_command,
        arg: *const ::std::os::raw::c_char,
        length: usize,
        skipp_check: my_bool,
        opt_arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn stmt_set_error(
        stmt: *mut MYSQL_STMT,
        error_nr: ::std::os::raw::c_uint,
        sqlstate: *const ::std::os::raw::c_char,
        format: *const ::std::os::raw::c_char,
        ...
    );
}
unsafe extern "C" {
    pub fn mysql_stmt_init(mysql: *mut MYSQL) -> *mut MYSQL_STMT;
}
unsafe extern "C" {
    pub fn mysql_stmt_prepare(
        stmt: *mut MYSQL_STMT,
        query: *const ::std::os::raw::c_char,
        length: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_stmt_execute(stmt: *mut MYSQL_STMT) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_stmt_fetch(stmt: *mut MYSQL_STMT) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_stmt_fetch_column(
        stmt: *mut MYSQL_STMT,
        bind_arg: *mut MYSQL_BIND,
        column: ::std::os::raw::c_uint,
        offset: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_stmt_store_result(stmt: *mut MYSQL_STMT) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_stmt_param_count(stmt: *mut MYSQL_STMT) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn mysql_stmt_attr_set(
        stmt: *mut MYSQL_STMT,
        attr_type: enum_stmt_attr_type,
        attr: *const ::std::os::raw::c_void,
    ) -> my_bool;
}
unsafe extern "C" {
    pub fn mysql_stmt_attr_get(
        stmt: *mut MYSQL_STMT,
        attr_type: enum_stmt_attr_type,
        attr: *mut ::std::os::raw::c_void,
    ) -> my_bool;
}
unsafe extern "C" {
    pub fn mysql_stmt_bind_param(stmt: *mut MYSQL_STMT, bnd: *mut MYSQL_BIND) -> my_bool;
}
unsafe extern "C" {
    pub fn mysql_stmt_bind_result(stmt: *mut MYSQL_STMT, bnd: *mut MYSQL_BIND) -> my_bool;
}
unsafe extern "C" {
    pub fn mysql_stmt_close(stmt: *mut MYSQL_STMT) -> my_bool;
}
unsafe extern "C" {
    pub fn mysql_stmt_reset(stmt: *mut MYSQL_STMT) -> my_bool;
}
unsafe extern "C" {
    pub fn mysql_stmt_free_result(stmt: *mut MYSQL_STMT) -> my_bool;
}
unsafe extern "C" {
    pub fn mysql_stmt_send_long_data(
        stmt: *mut MYSQL_STMT,
        param_number: ::std::os::raw::c_uint,
        data: *const ::std::os::raw::c_char,
        length: ::std::os::raw::c_ulong,
    ) -> my_bool;
}
unsafe extern "C" {
    pub fn mysql_stmt_result_metadata(stmt: *mut MYSQL_STMT) -> *mut MYSQL_RES;
}
unsafe extern "C" {
    pub fn mysql_stmt_param_metadata(stmt: *mut MYSQL_STMT) -> *mut MYSQL_RES;
}
unsafe extern "C" {
    pub fn mysql_stmt_errno(stmt: *mut MYSQL_STMT) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn mysql_stmt_error(stmt: *mut MYSQL_STMT) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn mysql_stmt_sqlstate(stmt: *mut MYSQL_STMT) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn mysql_stmt_row_seek(stmt: *mut MYSQL_STMT, offset: MYSQL_ROW_OFFSET)
    -> MYSQL_ROW_OFFSET;
}
unsafe extern "C" {
    pub fn mysql_stmt_row_tell(stmt: *mut MYSQL_STMT) -> MYSQL_ROW_OFFSET;
}
unsafe extern "C" {
    pub fn mysql_stmt_data_seek(stmt: *mut MYSQL_STMT, offset: ::std::os::raw::c_ulonglong);
}
unsafe extern "C" {
    pub fn mysql_stmt_num_rows(stmt: *mut MYSQL_STMT) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn mysql_stmt_affected_rows(stmt: *mut MYSQL_STMT) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn mysql_stmt_insert_id(stmt: *mut MYSQL_STMT) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn mysql_stmt_field_count(stmt: *mut MYSQL_STMT) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn mysql_stmt_next_result(stmt: *mut MYSQL_STMT) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_stmt_more_results(stmt: *mut MYSQL_STMT) -> my_bool;
}
unsafe extern "C" {
    pub fn mariadb_stmt_execute_direct(
        stmt: *mut MYSQL_STMT,
        stmt_str: *const ::std::os::raw::c_char,
        length: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mariadb_stmt_fetch_fields(stmt: *mut MYSQL_STMT) -> *mut MYSQL_FIELD;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct st_mysql_client_plugin {
    pub type_: ::std::os::raw::c_int,
    pub interface_version: ::std::os::raw::c_uint,
    pub name: *const ::std::os::raw::c_char,
    pub author: *const ::std::os::raw::c_char,
    pub desc: *const ::std::os::raw::c_char,
    pub version: [::std::os::raw::c_uint; 3usize],
    pub license: *const ::std::os::raw::c_char,
    pub mysql_api: *mut ::std::os::raw::c_void,
    pub init: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_char,
            arg2: usize,
            arg3: ::std::os::raw::c_int,
            arg4: *mut __va_list_tag,
        ) -> ::std::os::raw::c_int,
    >,
    pub deinit: ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_int>,
    pub options: ::std::option::Option<
        unsafe extern "C" fn(
            option: *const ::std::os::raw::c_char,
            arg1: *const ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of st_mysql_client_plugin"][::std::mem::size_of::<st_mysql_client_plugin>() - 88usize];
    ["Alignment of st_mysql_client_plugin"]
        [::std::mem::align_of::<st_mysql_client_plugin>() - 8usize];
    ["Offset of field: st_mysql_client_plugin::type_"]
        [::std::mem::offset_of!(st_mysql_client_plugin, type_) - 0usize];
    ["Offset of field: st_mysql_client_plugin::interface_version"]
        [::std::mem::offset_of!(st_mysql_client_plugin, interface_version) - 4usize];
    ["Offset of field: st_mysql_client_plugin::name"]
        [::std::mem::offset_of!(st_mysql_client_plugin, name) - 8usize];
    ["Offset of field: st_mysql_client_plugin::author"]
        [::std::mem::offset_of!(st_mysql_client_plugin, author) - 16usize];
    ["Offset of field: st_mysql_client_plugin::desc"]
        [::std::mem::offset_of!(st_mysql_client_plugin, desc) - 24usize];
    ["Offset of field: st_mysql_client_plugin::version"]
        [::std::mem::offset_of!(st_mysql_client_plugin, version) - 32usize];
    ["Offset of field: st_mysql_client_plugin::license"]
        [::std::mem::offset_of!(st_mysql_client_plugin, license) - 48usize];
    ["Offset of field: st_mysql_client_plugin::mysql_api"]
        [::std::mem::offset_of!(st_mysql_client_plugin, mysql_api) - 56usize];
    ["Offset of field: st_mysql_client_plugin::init"]
        [::std::mem::offset_of!(st_mysql_client_plugin, init) - 64usize];
    ["Offset of field: st_mysql_client_plugin::deinit"]
        [::std::mem::offset_of!(st_mysql_client_plugin, deinit) - 72usize];
    ["Offset of field: st_mysql_client_plugin::options"]
        [::std::mem::offset_of!(st_mysql_client_plugin, options) - 80usize];
};
pub const mariadb_tls_verification_MARIADB_VERIFY_NONE: mariadb_tls_verification = 0;
pub const mariadb_tls_verification_MARIADB_VERIFY_PIPE: mariadb_tls_verification = 1;
pub const mariadb_tls_verification_MARIADB_VERIFY_UNIXSOCKET: mariadb_tls_verification = 2;
pub const mariadb_tls_verification_MARIADB_VERIFY_LOCALHOST: mariadb_tls_verification = 3;
pub const mariadb_tls_verification_MARIADB_VERIFY_FINGERPRINT: mariadb_tls_verification = 4;
pub const mariadb_tls_verification_MARIADB_VERIFY_PEER_CERT: mariadb_tls_verification = 5;
pub type mariadb_tls_verification = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MARIADB_X509_INFO {
    pub version: ::std::os::raw::c_int,
    pub issuer: *mut ::std::os::raw::c_char,
    pub subject: *mut ::std::os::raw::c_char,
    pub fingerprint: [::std::os::raw::c_char; 129usize],
    pub not_before: tm,
    pub not_after: tm,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MARIADB_X509_INFO"][::std::mem::size_of::<MARIADB_X509_INFO>() - 272usize];
    ["Alignment of MARIADB_X509_INFO"][::std::mem::align_of::<MARIADB_X509_INFO>() - 8usize];
    ["Offset of field: MARIADB_X509_INFO::version"]
        [::std::mem::offset_of!(MARIADB_X509_INFO, version) - 0usize];
    ["Offset of field: MARIADB_X509_INFO::issuer"]
        [::std::mem::offset_of!(MARIADB_X509_INFO, issuer) - 8usize];
    ["Offset of field: MARIADB_X509_INFO::subject"]
        [::std::mem::offset_of!(MARIADB_X509_INFO, subject) - 16usize];
    ["Offset of field: MARIADB_X509_INFO::fingerprint"]
        [::std::mem::offset_of!(MARIADB_X509_INFO, fingerprint) - 24usize];
    ["Offset of field: MARIADB_X509_INFO::not_before"]
        [::std::mem::offset_of!(MARIADB_X509_INFO, not_before) - 160usize];
    ["Offset of field: MARIADB_X509_INFO::not_after"]
        [::std::mem::offset_of!(MARIADB_X509_INFO, not_after) - 216usize];
};
unsafe extern "C" {
    pub fn mysql_load_plugin(
        mysql: *mut st_mysql,
        name: *const ::std::os::raw::c_char,
        type_: ::std::os::raw::c_int,
        argc: ::std::os::raw::c_int,
        ...
    ) -> *mut st_mysql_client_plugin;
}
unsafe extern "C" {
    pub fn mysql_load_plugin_v(
        mysql: *mut st_mysql,
        name: *const ::std::os::raw::c_char,
        type_: ::std::os::raw::c_int,
        argc: ::std::os::raw::c_int,
        args: *mut __va_list_tag,
    ) -> *mut st_mysql_client_plugin;
}
unsafe extern "C" {
    pub fn mysql_client_find_plugin(
        mysql: *mut st_mysql,
        name: *const ::std::os::raw::c_char,
        type_: ::std::os::raw::c_int,
    ) -> *mut st_mysql_client_plugin;
}
unsafe extern "C" {
    pub fn mysql_client_register_plugin(
        mysql: *mut st_mysql,
        plugin: *mut st_mysql_client_plugin,
    ) -> *mut st_mysql_client_plugin;
}
unsafe extern "C" {
    pub fn mysql_set_local_infile_handler(
        mysql: *mut MYSQL,
        local_infile_init: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut *mut ::std::os::raw::c_void,
                arg2: *const ::std::os::raw::c_char,
                arg3: *mut ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
        local_infile_read: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: *mut ::std::os::raw::c_char,
                arg3: ::std::os::raw::c_uint,
            ) -> ::std::os::raw::c_int,
        >,
        local_infile_end: ::std::option::Option<
            unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void),
        >,
        local_infile_error: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: *mut ::std::os::raw::c_char,
                arg3: ::std::os::raw::c_uint,
            ) -> ::std::os::raw::c_int,
        >,
        arg1: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn mysql_set_local_infile_default(mysql: *mut MYSQL);
}
unsafe extern "C" {
    pub fn my_set_error(
        mysql: *mut MYSQL,
        error_nr: ::std::os::raw::c_uint,
        sqlstate: *const ::std::os::raw::c_char,
        format: *const ::std::os::raw::c_char,
        ...
    );
}
unsafe extern "C" {
    pub fn mysql_num_rows(res: *mut MYSQL_RES) -> my_ulonglong;
}
unsafe extern "C" {
    pub fn mysql_num_fields(res: *mut MYSQL_RES) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn mysql_eof(res: *mut MYSQL_RES) -> my_bool;
}
unsafe extern "C" {
    pub fn mysql_fetch_field_direct(
        res: *mut MYSQL_RES,
        fieldnr: ::std::os::raw::c_uint,
    ) -> *mut MYSQL_FIELD;
}
unsafe extern "C" {
    pub fn mysql_fetch_fields(res: *mut MYSQL_RES) -> *mut MYSQL_FIELD;
}
unsafe extern "C" {
    pub fn mysql_row_tell(res: *mut MYSQL_RES) -> *mut MYSQL_ROWS;
}
unsafe extern "C" {
    pub fn mysql_field_tell(res: *mut MYSQL_RES) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn mysql_field_count(mysql: *mut MYSQL) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn mysql_more_results(mysql: *mut MYSQL) -> my_bool;
}
unsafe extern "C" {
    pub fn mysql_next_result(mysql: *mut MYSQL) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_affected_rows(mysql: *mut MYSQL) -> my_ulonglong;
}
unsafe extern "C" {
    pub fn mysql_autocommit(mysql: *mut MYSQL, mode: my_bool) -> my_bool;
}
unsafe extern "C" {
    pub fn mysql_commit(mysql: *mut MYSQL) -> my_bool;
}
unsafe extern "C" {
    pub fn mysql_rollback(mysql: *mut MYSQL) -> my_bool;
}
unsafe extern "C" {
    pub fn mysql_insert_id(mysql: *mut MYSQL) -> my_ulonglong;
}
unsafe extern "C" {
    pub fn mysql_errno(mysql: *mut MYSQL) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn mysql_error(mysql: *mut MYSQL) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn mysql_info(mysql: *mut MYSQL) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn mysql_thread_id(mysql: *mut MYSQL) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn mysql_character_set_name(mysql: *mut MYSQL) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn mysql_get_character_set_info(mysql: *mut MYSQL, cs: *mut MY_CHARSET_INFO);
}
unsafe extern "C" {
    pub fn mysql_set_character_set(
        mysql: *mut MYSQL,
        csname: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mariadb_get_infov(
        mysql: *mut MYSQL,
        value: mariadb_value,
        arg: *mut ::std::os::raw::c_void,
        ...
    ) -> my_bool;
}
unsafe extern "C" {
    pub fn mariadb_get_info(
        mysql: *mut MYSQL,
        value: mariadb_value,
        arg: *mut ::std::os::raw::c_void,
    ) -> my_bool;
}
unsafe extern "C" {
    pub fn mysql_init(mysql: *mut MYSQL) -> *mut MYSQL;
}
unsafe extern "C" {
    pub fn mysql_ssl_set(
        mysql: *mut MYSQL,
        key: *const ::std::os::raw::c_char,
        cert: *const ::std::os::raw::c_char,
        ca: *const ::std::os::raw::c_char,
        capath: *const ::std::os::raw::c_char,
        cipher: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_get_ssl_cipher(mysql: *mut MYSQL) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn mysql_change_user(
        mysql: *mut MYSQL,
        user: *const ::std::os::raw::c_char,
        passwd: *const ::std::os::raw::c_char,
        db: *const ::std::os::raw::c_char,
    ) -> my_bool;
}
unsafe extern "C" {
    pub fn mysql_real_connect(
        mysql: *mut MYSQL,
        host: *const ::std::os::raw::c_char,
        user: *const ::std::os::raw::c_char,
        passwd: *const ::std::os::raw::c_char,
        db: *const ::std::os::raw::c_char,
        port: ::std::os::raw::c_uint,
        unix_socket: *const ::std::os::raw::c_char,
        clientflag: ::std::os::raw::c_ulong,
    ) -> *mut MYSQL;
}
unsafe extern "C" {
    pub fn mysql_close(sock: *mut MYSQL);
}
unsafe extern "C" {
    pub fn mysql_select_db(
        mysql: *mut MYSQL,
        db: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_query(
        mysql: *mut MYSQL,
        q: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_send_query(
        mysql: *mut MYSQL,
        q: *const ::std::os::raw::c_char,
        length: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_read_query_result(mysql: *mut MYSQL) -> my_bool;
}
unsafe extern "C" {
    pub fn mysql_real_query(
        mysql: *mut MYSQL,
        q: *const ::std::os::raw::c_char,
        length: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_shutdown(
        mysql: *mut MYSQL,
        shutdown_level: mysql_enum_shutdown_level,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_dump_debug_info(mysql: *mut MYSQL) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_refresh(
        mysql: *mut MYSQL,
        refresh_options: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_kill(mysql: *mut MYSQL, pid: ::std::os::raw::c_ulong) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_ping(mysql: *mut MYSQL) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_stat(mysql: *mut MYSQL) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn mysql_get_server_info(mysql: *mut MYSQL) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn mysql_get_server_version(mysql: *mut MYSQL) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn mysql_get_host_info(mysql: *mut MYSQL) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn mysql_get_proto_info(mysql: *mut MYSQL) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn mysql_list_dbs(mysql: *mut MYSQL, wild: *const ::std::os::raw::c_char)
    -> *mut MYSQL_RES;
}
unsafe extern "C" {
    pub fn mysql_list_tables(
        mysql: *mut MYSQL,
        wild: *const ::std::os::raw::c_char,
    ) -> *mut MYSQL_RES;
}
unsafe extern "C" {
    pub fn mysql_list_fields(
        mysql: *mut MYSQL,
        table: *const ::std::os::raw::c_char,
        wild: *const ::std::os::raw::c_char,
    ) -> *mut MYSQL_RES;
}
unsafe extern "C" {
    pub fn mysql_list_processes(mysql: *mut MYSQL) -> *mut MYSQL_RES;
}
unsafe extern "C" {
    pub fn mysql_store_result(mysql: *mut MYSQL) -> *mut MYSQL_RES;
}
unsafe extern "C" {
    pub fn mysql_use_result(mysql: *mut MYSQL) -> *mut MYSQL_RES;
}
unsafe extern "C" {
    pub fn mysql_options(
        mysql: *mut MYSQL,
        option: mysql_option,
        arg: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_options4(
        mysql: *mut MYSQL,
        option: mysql_option,
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_free_result(result: *mut MYSQL_RES);
}
unsafe extern "C" {
    pub fn mysql_data_seek(result: *mut MYSQL_RES, offset: ::std::os::raw::c_ulonglong);
}
unsafe extern "C" {
    pub fn mysql_row_seek(result: *mut MYSQL_RES, arg1: MYSQL_ROW_OFFSET) -> MYSQL_ROW_OFFSET;
}
unsafe extern "C" {
    pub fn mysql_field_seek(
        result: *mut MYSQL_RES,
        offset: MYSQL_FIELD_OFFSET,
    ) -> MYSQL_FIELD_OFFSET;
}
unsafe extern "C" {
    pub fn mysql_fetch_row(result: *mut MYSQL_RES) -> MYSQL_ROW;
}
unsafe extern "C" {
    pub fn mysql_fetch_lengths(result: *mut MYSQL_RES) -> *mut ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn mysql_fetch_field(result: *mut MYSQL_RES) -> *mut MYSQL_FIELD;
}
unsafe extern "C" {
    pub fn mysql_escape_string(
        to: *mut ::std::os::raw::c_char,
        from: *const ::std::os::raw::c_char,
        from_length: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn mysql_real_escape_string(
        mysql: *mut MYSQL,
        to: *mut ::std::os::raw::c_char,
        from: *const ::std::os::raw::c_char,
        length: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn mysql_thread_safe() -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn mysql_warning_count(mysql: *mut MYSQL) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn mysql_sqlstate(mysql: *mut MYSQL) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn mysql_server_init(
        argc: ::std::os::raw::c_int,
        argv: *mut *mut ::std::os::raw::c_char,
        groups: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_server_end();
}
unsafe extern "C" {
    pub fn mysql_thread_end();
}
unsafe extern "C" {
    pub fn mysql_thread_init() -> my_bool;
}
unsafe extern "C" {
    pub fn mysql_set_server_option(
        mysql: *mut MYSQL,
        option: enum_mysql_set_option,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_get_client_info() -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn mysql_get_client_version() -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn mariadb_connection(mysql: *mut MYSQL) -> my_bool;
}
unsafe extern "C" {
    pub fn mysql_get_server_name(mysql: *mut MYSQL) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn mariadb_get_charset_by_name(
        csname: *const ::std::os::raw::c_char,
    ) -> *mut MARIADB_CHARSET_INFO;
}
unsafe extern "C" {
    pub fn mariadb_get_charset_by_nr(csnr: ::std::os::raw::c_uint) -> *mut MARIADB_CHARSET_INFO;
}
unsafe extern "C" {
    pub fn mariadb_convert_string(
        from: *const ::std::os::raw::c_char,
        from_len: *mut usize,
        from_cs: *mut MARIADB_CHARSET_INFO,
        to: *mut ::std::os::raw::c_char,
        to_len: *mut usize,
        to_cs: *mut MARIADB_CHARSET_INFO,
        errorcode: *mut ::std::os::raw::c_int,
    ) -> usize;
}
unsafe extern "C" {
    pub fn mysql_optionsv(mysql: *mut MYSQL, option: mysql_option, ...) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_get_optionv(
        mysql: *mut MYSQL,
        option: mysql_option,
        arg: *mut ::std::os::raw::c_void,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_get_option(
        mysql: *mut MYSQL,
        option: mysql_option,
        arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_hex_string(
        to: *mut ::std::os::raw::c_char,
        from: *const ::std::os::raw::c_char,
        len: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn mysql_get_socket(mysql: *mut MYSQL) -> my_socket;
}
unsafe extern "C" {
    pub fn mysql_get_timeout_value(mysql: *const MYSQL) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn mysql_get_timeout_value_ms(mysql: *const MYSQL) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn mariadb_reconnect(mysql: *mut MYSQL) -> my_bool;
}
unsafe extern "C" {
    pub fn mariadb_cancel(mysql: *mut MYSQL) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_debug(debug: *const ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn mysql_net_read_packet(mysql: *mut MYSQL) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn mysql_net_field_length(
        packet: *mut *mut ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn mysql_embedded() -> my_bool;
}
unsafe extern "C" {
    pub fn mysql_get_parameters() -> *mut MYSQL_PARAMETERS;
}
unsafe extern "C" {
    pub fn mysql_close_start(sock: *mut MYSQL) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_close_cont(
        sock: *mut MYSQL,
        status: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_commit_start(ret: *mut my_bool, mysql: *mut MYSQL) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_commit_cont(
        ret: *mut my_bool,
        mysql: *mut MYSQL,
        status: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_dump_debug_info_cont(
        ret: *mut ::std::os::raw::c_int,
        mysql: *mut MYSQL,
        ready_status: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_dump_debug_info_start(
        ret: *mut ::std::os::raw::c_int,
        mysql: *mut MYSQL,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_rollback_start(ret: *mut my_bool, mysql: *mut MYSQL) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_rollback_cont(
        ret: *mut my_bool,
        mysql: *mut MYSQL,
        status: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_autocommit_start(
        ret: *mut my_bool,
        mysql: *mut MYSQL,
        auto_mode: my_bool,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_list_fields_cont(
        ret: *mut *mut MYSQL_RES,
        mysql: *mut MYSQL,
        ready_status: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_list_fields_start(
        ret: *mut *mut MYSQL_RES,
        mysql: *mut MYSQL,
        table: *const ::std::os::raw::c_char,
        wild: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_autocommit_cont(
        ret: *mut my_bool,
        mysql: *mut MYSQL,
        status: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_next_result_start(
        ret: *mut ::std::os::raw::c_int,
        mysql: *mut MYSQL,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_next_result_cont(
        ret: *mut ::std::os::raw::c_int,
        mysql: *mut MYSQL,
        status: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_select_db_start(
        ret: *mut ::std::os::raw::c_int,
        mysql: *mut MYSQL,
        db: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_select_db_cont(
        ret: *mut ::std::os::raw::c_int,
        mysql: *mut MYSQL,
        ready_status: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_stmt_warning_count(stmt: *mut MYSQL_STMT) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_stmt_next_result_start(
        ret: *mut ::std::os::raw::c_int,
        stmt: *mut MYSQL_STMT,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_stmt_next_result_cont(
        ret: *mut ::std::os::raw::c_int,
        stmt: *mut MYSQL_STMT,
        status: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_set_character_set_start(
        ret: *mut ::std::os::raw::c_int,
        mysql: *mut MYSQL,
        csname: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_set_character_set_cont(
        ret: *mut ::std::os::raw::c_int,
        mysql: *mut MYSQL,
        status: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_change_user_start(
        ret: *mut my_bool,
        mysql: *mut MYSQL,
        user: *const ::std::os::raw::c_char,
        passwd: *const ::std::os::raw::c_char,
        db: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_change_user_cont(
        ret: *mut my_bool,
        mysql: *mut MYSQL,
        status: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_real_connect_start(
        ret: *mut *mut MYSQL,
        mysql: *mut MYSQL,
        host: *const ::std::os::raw::c_char,
        user: *const ::std::os::raw::c_char,
        passwd: *const ::std::os::raw::c_char,
        db: *const ::std::os::raw::c_char,
        port: ::std::os::raw::c_uint,
        unix_socket: *const ::std::os::raw::c_char,
        clientflag: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_real_connect_cont(
        ret: *mut *mut MYSQL,
        mysql: *mut MYSQL,
        status: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_query_start(
        ret: *mut ::std::os::raw::c_int,
        mysql: *mut MYSQL,
        q: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_query_cont(
        ret: *mut ::std::os::raw::c_int,
        mysql: *mut MYSQL,
        status: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_send_query_start(
        ret: *mut ::std::os::raw::c_int,
        mysql: *mut MYSQL,
        q: *const ::std::os::raw::c_char,
        length: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_send_query_cont(
        ret: *mut ::std::os::raw::c_int,
        mysql: *mut MYSQL,
        status: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_real_query_start(
        ret: *mut ::std::os::raw::c_int,
        mysql: *mut MYSQL,
        q: *const ::std::os::raw::c_char,
        length: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_real_query_cont(
        ret: *mut ::std::os::raw::c_int,
        mysql: *mut MYSQL,
        status: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_store_result_start(
        ret: *mut *mut MYSQL_RES,
        mysql: *mut MYSQL,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_store_result_cont(
        ret: *mut *mut MYSQL_RES,
        mysql: *mut MYSQL,
        status: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_shutdown_start(
        ret: *mut ::std::os::raw::c_int,
        mysql: *mut MYSQL,
        shutdown_level: mysql_enum_shutdown_level,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_shutdown_cont(
        ret: *mut ::std::os::raw::c_int,
        mysql: *mut MYSQL,
        status: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_refresh_start(
        ret: *mut ::std::os::raw::c_int,
        mysql: *mut MYSQL,
        refresh_options: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_refresh_cont(
        ret: *mut ::std::os::raw::c_int,
        mysql: *mut MYSQL,
        status: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_kill_start(
        ret: *mut ::std::os::raw::c_int,
        mysql: *mut MYSQL,
        pid: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_kill_cont(
        ret: *mut ::std::os::raw::c_int,
        mysql: *mut MYSQL,
        status: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_set_server_option_start(
        ret: *mut ::std::os::raw::c_int,
        mysql: *mut MYSQL,
        option: enum_mysql_set_option,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_set_server_option_cont(
        ret: *mut ::std::os::raw::c_int,
        mysql: *mut MYSQL,
        status: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_ping_start(
        ret: *mut ::std::os::raw::c_int,
        mysql: *mut MYSQL,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_ping_cont(
        ret: *mut ::std::os::raw::c_int,
        mysql: *mut MYSQL,
        status: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_stat_start(
        ret: *mut *const ::std::os::raw::c_char,
        mysql: *mut MYSQL,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_stat_cont(
        ret: *mut *const ::std::os::raw::c_char,
        mysql: *mut MYSQL,
        status: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_free_result_start(result: *mut MYSQL_RES) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_free_result_cont(
        result: *mut MYSQL_RES,
        status: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_fetch_row_start(
        ret: *mut MYSQL_ROW,
        result: *mut MYSQL_RES,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_fetch_row_cont(
        ret: *mut MYSQL_ROW,
        result: *mut MYSQL_RES,
        status: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_read_query_result_start(
        ret: *mut my_bool,
        mysql: *mut MYSQL,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_read_query_result_cont(
        ret: *mut my_bool,
        mysql: *mut MYSQL,
        status: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_reset_connection_start(
        ret: *mut ::std::os::raw::c_int,
        mysql: *mut MYSQL,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_reset_connection_cont(
        ret: *mut ::std::os::raw::c_int,
        mysql: *mut MYSQL,
        status: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_session_track_get_next(
        mysql: *mut MYSQL,
        type_: enum_session_state_type,
        data: *mut *const ::std::os::raw::c_char,
        length: *mut usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_session_track_get_first(
        mysql: *mut MYSQL,
        type_: enum_session_state_type,
        data: *mut *const ::std::os::raw::c_char,
        length: *mut usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_stmt_prepare_start(
        ret: *mut ::std::os::raw::c_int,
        stmt: *mut MYSQL_STMT,
        query: *const ::std::os::raw::c_char,
        length: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_stmt_prepare_cont(
        ret: *mut ::std::os::raw::c_int,
        stmt: *mut MYSQL_STMT,
        status: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_stmt_execute_start(
        ret: *mut ::std::os::raw::c_int,
        stmt: *mut MYSQL_STMT,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_stmt_execute_cont(
        ret: *mut ::std::os::raw::c_int,
        stmt: *mut MYSQL_STMT,
        status: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_stmt_fetch_start(
        ret: *mut ::std::os::raw::c_int,
        stmt: *mut MYSQL_STMT,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_stmt_fetch_cont(
        ret: *mut ::std::os::raw::c_int,
        stmt: *mut MYSQL_STMT,
        status: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_stmt_store_result_start(
        ret: *mut ::std::os::raw::c_int,
        stmt: *mut MYSQL_STMT,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_stmt_store_result_cont(
        ret: *mut ::std::os::raw::c_int,
        stmt: *mut MYSQL_STMT,
        status: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_stmt_close_start(
        ret: *mut my_bool,
        stmt: *mut MYSQL_STMT,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_stmt_close_cont(
        ret: *mut my_bool,
        stmt: *mut MYSQL_STMT,
        status: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_stmt_reset_start(
        ret: *mut my_bool,
        stmt: *mut MYSQL_STMT,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_stmt_reset_cont(
        ret: *mut my_bool,
        stmt: *mut MYSQL_STMT,
        status: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_stmt_free_result_start(
        ret: *mut my_bool,
        stmt: *mut MYSQL_STMT,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_stmt_free_result_cont(
        ret: *mut my_bool,
        stmt: *mut MYSQL_STMT,
        status: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_stmt_send_long_data_start(
        ret: *mut my_bool,
        stmt: *mut MYSQL_STMT,
        param_number: ::std::os::raw::c_uint,
        data: *const ::std::os::raw::c_char,
        len: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_stmt_send_long_data_cont(
        ret: *mut my_bool,
        stmt: *mut MYSQL_STMT,
        status: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mysql_reset_connection(mysql: *mut MYSQL) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct st_mariadb_api {
    pub mysql_num_rows: ::std::option::Option<
        unsafe extern "C" fn(res: *mut MYSQL_RES) -> ::std::os::raw::c_ulonglong,
    >,
    pub mysql_num_fields:
        ::std::option::Option<unsafe extern "C" fn(res: *mut MYSQL_RES) -> ::std::os::raw::c_uint>,
    pub mysql_eof: ::std::option::Option<unsafe extern "C" fn(res: *mut MYSQL_RES) -> my_bool>,
    pub mysql_fetch_field_direct: ::std::option::Option<
        unsafe extern "C" fn(
            res: *mut MYSQL_RES,
            fieldnr: ::std::os::raw::c_uint,
        ) -> *mut MYSQL_FIELD,
    >,
    pub mysql_fetch_fields:
        ::std::option::Option<unsafe extern "C" fn(res: *mut MYSQL_RES) -> *mut MYSQL_FIELD>,
    pub mysql_row_tell:
        ::std::option::Option<unsafe extern "C" fn(res: *mut MYSQL_RES) -> *mut MYSQL_ROWS>,
    pub mysql_field_tell:
        ::std::option::Option<unsafe extern "C" fn(res: *mut MYSQL_RES) -> ::std::os::raw::c_uint>,
    pub mysql_field_count:
        ::std::option::Option<unsafe extern "C" fn(mysql: *mut MYSQL) -> ::std::os::raw::c_uint>,
    pub mysql_more_results:
        ::std::option::Option<unsafe extern "C" fn(mysql: *mut MYSQL) -> my_bool>,
    pub mysql_next_result:
        ::std::option::Option<unsafe extern "C" fn(mysql: *mut MYSQL) -> ::std::os::raw::c_int>,
    pub mysql_affected_rows: ::std::option::Option<
        unsafe extern "C" fn(mysql: *mut MYSQL) -> ::std::os::raw::c_ulonglong,
    >,
    pub mysql_autocommit:
        ::std::option::Option<unsafe extern "C" fn(mysql: *mut MYSQL, mode: my_bool) -> my_bool>,
    pub mysql_commit: ::std::option::Option<unsafe extern "C" fn(mysql: *mut MYSQL) -> my_bool>,
    pub mysql_rollback: ::std::option::Option<unsafe extern "C" fn(mysql: *mut MYSQL) -> my_bool>,
    pub mysql_insert_id: ::std::option::Option<
        unsafe extern "C" fn(mysql: *mut MYSQL) -> ::std::os::raw::c_ulonglong,
    >,
    pub mysql_errno:
        ::std::option::Option<unsafe extern "C" fn(mysql: *mut MYSQL) -> ::std::os::raw::c_uint>,
    pub mysql_error: ::std::option::Option<
        unsafe extern "C" fn(mysql: *mut MYSQL) -> *const ::std::os::raw::c_char,
    >,
    pub mysql_info: ::std::option::Option<
        unsafe extern "C" fn(mysql: *mut MYSQL) -> *const ::std::os::raw::c_char,
    >,
    pub mysql_thread_id:
        ::std::option::Option<unsafe extern "C" fn(mysql: *mut MYSQL) -> ::std::os::raw::c_ulong>,
    pub mysql_character_set_name: ::std::option::Option<
        unsafe extern "C" fn(mysql: *mut MYSQL) -> *const ::std::os::raw::c_char,
    >,
    pub mysql_get_character_set_info:
        ::std::option::Option<unsafe extern "C" fn(mysql: *mut MYSQL, cs: *mut MY_CHARSET_INFO)>,
    pub mysql_set_character_set: ::std::option::Option<
        unsafe extern "C" fn(
            mysql: *mut MYSQL,
            csname: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    pub mariadb_get_infov: ::std::option::Option<
        unsafe extern "C" fn(
            mysql: *mut MYSQL,
            value: mariadb_value,
            arg: *mut ::std::os::raw::c_void,
            ...
        ) -> my_bool,
    >,
    pub mariadb_get_info: ::std::option::Option<
        unsafe extern "C" fn(
            mysql: *mut MYSQL,
            value: mariadb_value,
            arg: *mut ::std::os::raw::c_void,
        ) -> my_bool,
    >,
    pub mysql_init: ::std::option::Option<unsafe extern "C" fn(mysql: *mut MYSQL) -> *mut MYSQL>,
    pub mysql_ssl_set: ::std::option::Option<
        unsafe extern "C" fn(
            mysql: *mut MYSQL,
            key: *const ::std::os::raw::c_char,
            cert: *const ::std::os::raw::c_char,
            ca: *const ::std::os::raw::c_char,
            capath: *const ::std::os::raw::c_char,
            cipher: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    pub mysql_get_ssl_cipher: ::std::option::Option<
        unsafe extern "C" fn(mysql: *mut MYSQL) -> *const ::std::os::raw::c_char,
    >,
    pub mysql_change_user: ::std::option::Option<
        unsafe extern "C" fn(
            mysql: *mut MYSQL,
            user: *const ::std::os::raw::c_char,
            passwd: *const ::std::os::raw::c_char,
            db: *const ::std::os::raw::c_char,
        ) -> my_bool,
    >,
    pub mysql_real_connect: ::std::option::Option<
        unsafe extern "C" fn(
            mysql: *mut MYSQL,
            host: *const ::std::os::raw::c_char,
            user: *const ::std::os::raw::c_char,
            passwd: *const ::std::os::raw::c_char,
            db: *const ::std::os::raw::c_char,
            port: ::std::os::raw::c_uint,
            unix_socket: *const ::std::os::raw::c_char,
            clientflag: ::std::os::raw::c_ulong,
        ) -> *mut MYSQL,
    >,
    pub mysql_close: ::std::option::Option<unsafe extern "C" fn(sock: *mut MYSQL)>,
    pub mysql_select_db: ::std::option::Option<
        unsafe extern "C" fn(
            mysql: *mut MYSQL,
            db: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    pub mysql_query: ::std::option::Option<
        unsafe extern "C" fn(
            mysql: *mut MYSQL,
            q: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    pub mysql_send_query: ::std::option::Option<
        unsafe extern "C" fn(
            mysql: *mut MYSQL,
            q: *const ::std::os::raw::c_char,
            length: ::std::os::raw::c_ulong,
        ) -> ::std::os::raw::c_int,
    >,
    pub mysql_read_query_result:
        ::std::option::Option<unsafe extern "C" fn(mysql: *mut MYSQL) -> my_bool>,
    pub mysql_real_query: ::std::option::Option<
        unsafe extern "C" fn(
            mysql: *mut MYSQL,
            q: *const ::std::os::raw::c_char,
            length: ::std::os::raw::c_ulong,
        ) -> ::std::os::raw::c_int,
    >,
    pub mysql_shutdown: ::std::option::Option<
        unsafe extern "C" fn(
            mysql: *mut MYSQL,
            shutdown_level: mysql_enum_shutdown_level,
        ) -> ::std::os::raw::c_int,
    >,
    pub mysql_dump_debug_info:
        ::std::option::Option<unsafe extern "C" fn(mysql: *mut MYSQL) -> ::std::os::raw::c_int>,
    pub mysql_refresh: ::std::option::Option<
        unsafe extern "C" fn(
            mysql: *mut MYSQL,
            refresh_options: ::std::os::raw::c_uint,
        ) -> ::std::os::raw::c_int,
    >,
    pub mysql_kill: ::std::option::Option<
        unsafe extern "C" fn(
            mysql: *mut MYSQL,
            pid: ::std::os::raw::c_ulong,
        ) -> ::std::os::raw::c_int,
    >,
    pub mysql_ping:
        ::std::option::Option<unsafe extern "C" fn(mysql: *mut MYSQL) -> ::std::os::raw::c_int>,
    pub mysql_stat: ::std::option::Option<
        unsafe extern "C" fn(mysql: *mut MYSQL) -> *mut ::std::os::raw::c_char,
    >,
    pub mysql_get_server_info: ::std::option::Option<
        unsafe extern "C" fn(mysql: *mut MYSQL) -> *mut ::std::os::raw::c_char,
    >,
    pub mysql_get_server_version:
        ::std::option::Option<unsafe extern "C" fn(mysql: *mut MYSQL) -> ::std::os::raw::c_ulong>,
    pub mysql_get_host_info: ::std::option::Option<
        unsafe extern "C" fn(mysql: *mut MYSQL) -> *mut ::std::os::raw::c_char,
    >,
    pub mysql_get_proto_info:
        ::std::option::Option<unsafe extern "C" fn(mysql: *mut MYSQL) -> ::std::os::raw::c_uint>,
    pub mysql_list_dbs: ::std::option::Option<
        unsafe extern "C" fn(
            mysql: *mut MYSQL,
            wild: *const ::std::os::raw::c_char,
        ) -> *mut MYSQL_RES,
    >,
    pub mysql_list_tables: ::std::option::Option<
        unsafe extern "C" fn(
            mysql: *mut MYSQL,
            wild: *const ::std::os::raw::c_char,
        ) -> *mut MYSQL_RES,
    >,
    pub mysql_list_fields: ::std::option::Option<
        unsafe extern "C" fn(
            mysql: *mut MYSQL,
            table: *const ::std::os::raw::c_char,
            wild: *const ::std::os::raw::c_char,
        ) -> *mut MYSQL_RES,
    >,
    pub mysql_list_processes:
        ::std::option::Option<unsafe extern "C" fn(mysql: *mut MYSQL) -> *mut MYSQL_RES>,
    pub mysql_store_result:
        ::std::option::Option<unsafe extern "C" fn(mysql: *mut MYSQL) -> *mut MYSQL_RES>,
    pub mysql_use_result:
        ::std::option::Option<unsafe extern "C" fn(mysql: *mut MYSQL) -> *mut MYSQL_RES>,
    pub mysql_options: ::std::option::Option<
        unsafe extern "C" fn(
            mysql: *mut MYSQL,
            option: mysql_option,
            arg: *const ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >,
    pub mysql_free_result: ::std::option::Option<unsafe extern "C" fn(result: *mut MYSQL_RES)>,
    pub mysql_data_seek: ::std::option::Option<
        unsafe extern "C" fn(result: *mut MYSQL_RES, offset: ::std::os::raw::c_ulonglong),
    >,
    pub mysql_row_seek: ::std::option::Option<
        unsafe extern "C" fn(result: *mut MYSQL_RES, arg1: MYSQL_ROW_OFFSET) -> MYSQL_ROW_OFFSET,
    >,
    pub mysql_field_seek: ::std::option::Option<
        unsafe extern "C" fn(
            result: *mut MYSQL_RES,
            offset: MYSQL_FIELD_OFFSET,
        ) -> MYSQL_FIELD_OFFSET,
    >,
    pub mysql_fetch_row:
        ::std::option::Option<unsafe extern "C" fn(result: *mut MYSQL_RES) -> MYSQL_ROW>,
    pub mysql_fetch_lengths: ::std::option::Option<
        unsafe extern "C" fn(result: *mut MYSQL_RES) -> *mut ::std::os::raw::c_ulong,
    >,
    pub mysql_fetch_field:
        ::std::option::Option<unsafe extern "C" fn(result: *mut MYSQL_RES) -> *mut MYSQL_FIELD>,
    pub mysql_escape_string: ::std::option::Option<
        unsafe extern "C" fn(
            to: *mut ::std::os::raw::c_char,
            from: *const ::std::os::raw::c_char,
            from_length: ::std::os::raw::c_ulong,
        ) -> ::std::os::raw::c_ulong,
    >,
    pub mysql_real_escape_string: ::std::option::Option<
        unsafe extern "C" fn(
            mysql: *mut MYSQL,
            to: *mut ::std::os::raw::c_char,
            from: *const ::std::os::raw::c_char,
            length: ::std::os::raw::c_ulong,
        ) -> ::std::os::raw::c_ulong,
    >,
    pub mysql_thread_safe: ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_uint>,
    pub mysql_warning_count:
        ::std::option::Option<unsafe extern "C" fn(mysql: *mut MYSQL) -> ::std::os::raw::c_uint>,
    pub mysql_sqlstate: ::std::option::Option<
        unsafe extern "C" fn(mysql: *mut MYSQL) -> *const ::std::os::raw::c_char,
    >,
    pub mysql_server_init: ::std::option::Option<
        unsafe extern "C" fn(
            argc: ::std::os::raw::c_int,
            argv: *mut *mut ::std::os::raw::c_char,
            groups: *mut *mut ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    pub mysql_server_end: ::std::option::Option<unsafe extern "C" fn()>,
    pub mysql_thread_end: ::std::option::Option<unsafe extern "C" fn()>,
    pub mysql_thread_init: ::std::option::Option<unsafe extern "C" fn() -> my_bool>,
    pub mysql_set_server_option: ::std::option::Option<
        unsafe extern "C" fn(
            mysql: *mut MYSQL,
            option: enum_mysql_set_option,
        ) -> ::std::os::raw::c_int,
    >,
    pub mysql_get_client_info:
        ::std::option::Option<unsafe extern "C" fn() -> *const ::std::os::raw::c_char>,
    pub mysql_get_client_version:
        ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_ulong>,
    pub mariadb_connection:
        ::std::option::Option<unsafe extern "C" fn(mysql: *mut MYSQL) -> my_bool>,
    pub mysql_get_server_name: ::std::option::Option<
        unsafe extern "C" fn(mysql: *mut MYSQL) -> *const ::std::os::raw::c_char,
    >,
    pub mariadb_get_charset_by_name: ::std::option::Option<
        unsafe extern "C" fn(csname: *const ::std::os::raw::c_char) -> *mut MARIADB_CHARSET_INFO,
    >,
    pub mariadb_get_charset_by_nr: ::std::option::Option<
        unsafe extern "C" fn(csnr: ::std::os::raw::c_uint) -> *mut MARIADB_CHARSET_INFO,
    >,
    pub mariadb_convert_string: ::std::option::Option<
        unsafe extern "C" fn(
            from: *const ::std::os::raw::c_char,
            from_len: *mut usize,
            from_cs: *mut MARIADB_CHARSET_INFO,
            to: *mut ::std::os::raw::c_char,
            to_len: *mut usize,
            to_cs: *mut MARIADB_CHARSET_INFO,
            errorcode: *mut ::std::os::raw::c_int,
        ) -> usize,
    >,
    pub mysql_optionsv: ::std::option::Option<
        unsafe extern "C" fn(mysql: *mut MYSQL, option: mysql_option, ...) -> ::std::os::raw::c_int,
    >,
    pub mysql_get_optionv: ::std::option::Option<
        unsafe extern "C" fn(
            mysql: *mut MYSQL,
            option: mysql_option,
            arg: *mut ::std::os::raw::c_void,
            ...
        ) -> ::std::os::raw::c_int,
    >,
    pub mysql_get_option: ::std::option::Option<
        unsafe extern "C" fn(
            mysql: *mut MYSQL,
            option: mysql_option,
            arg: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >,
    pub mysql_hex_string: ::std::option::Option<
        unsafe extern "C" fn(
            to: *mut ::std::os::raw::c_char,
            from: *const ::std::os::raw::c_char,
            len: ::std::os::raw::c_ulong,
        ) -> ::std::os::raw::c_ulong,
    >,
    pub mysql_get_socket:
        ::std::option::Option<unsafe extern "C" fn(mysql: *mut MYSQL) -> my_socket>,
    pub mysql_get_timeout_value:
        ::std::option::Option<unsafe extern "C" fn(mysql: *const MYSQL) -> ::std::os::raw::c_uint>,
    pub mysql_get_timeout_value_ms:
        ::std::option::Option<unsafe extern "C" fn(mysql: *const MYSQL) -> ::std::os::raw::c_uint>,
    pub mariadb_reconnect:
        ::std::option::Option<unsafe extern "C" fn(mysql: *mut MYSQL) -> my_bool>,
    pub mysql_stmt_init:
        ::std::option::Option<unsafe extern "C" fn(mysql: *mut MYSQL) -> *mut MYSQL_STMT>,
    pub mysql_stmt_prepare: ::std::option::Option<
        unsafe extern "C" fn(
            stmt: *mut MYSQL_STMT,
            query: *const ::std::os::raw::c_char,
            length: ::std::os::raw::c_ulong,
        ) -> ::std::os::raw::c_int,
    >,
    pub mysql_stmt_execute:
        ::std::option::Option<unsafe extern "C" fn(stmt: *mut MYSQL_STMT) -> ::std::os::raw::c_int>,
    pub mysql_stmt_fetch:
        ::std::option::Option<unsafe extern "C" fn(stmt: *mut MYSQL_STMT) -> ::std::os::raw::c_int>,
    pub mysql_stmt_fetch_column: ::std::option::Option<
        unsafe extern "C" fn(
            stmt: *mut MYSQL_STMT,
            bind_arg: *mut MYSQL_BIND,
            column: ::std::os::raw::c_uint,
            offset: ::std::os::raw::c_ulong,
        ) -> ::std::os::raw::c_int,
    >,
    pub mysql_stmt_store_result:
        ::std::option::Option<unsafe extern "C" fn(stmt: *mut MYSQL_STMT) -> ::std::os::raw::c_int>,
    pub mysql_stmt_param_count: ::std::option::Option<
        unsafe extern "C" fn(stmt: *mut MYSQL_STMT) -> ::std::os::raw::c_ulong,
    >,
    pub mysql_stmt_attr_set: ::std::option::Option<
        unsafe extern "C" fn(
            stmt: *mut MYSQL_STMT,
            attr_type: enum_stmt_attr_type,
            attr: *const ::std::os::raw::c_void,
        ) -> my_bool,
    >,
    pub mysql_stmt_attr_get: ::std::option::Option<
        unsafe extern "C" fn(
            stmt: *mut MYSQL_STMT,
            attr_type: enum_stmt_attr_type,
            attr: *mut ::std::os::raw::c_void,
        ) -> my_bool,
    >,
    pub mysql_stmt_bind_param: ::std::option::Option<
        unsafe extern "C" fn(stmt: *mut MYSQL_STMT, bnd: *mut MYSQL_BIND) -> my_bool,
    >,
    pub mysql_stmt_bind_result: ::std::option::Option<
        unsafe extern "C" fn(stmt: *mut MYSQL_STMT, bnd: *mut MYSQL_BIND) -> my_bool,
    >,
    pub mysql_stmt_close:
        ::std::option::Option<unsafe extern "C" fn(stmt: *mut MYSQL_STMT) -> my_bool>,
    pub mysql_stmt_reset:
        ::std::option::Option<unsafe extern "C" fn(stmt: *mut MYSQL_STMT) -> my_bool>,
    pub mysql_stmt_free_result:
        ::std::option::Option<unsafe extern "C" fn(stmt: *mut MYSQL_STMT) -> my_bool>,
    pub mysql_stmt_send_long_data: ::std::option::Option<
        unsafe extern "C" fn(
            stmt: *mut MYSQL_STMT,
            param_number: ::std::os::raw::c_uint,
            data: *const ::std::os::raw::c_char,
            length: ::std::os::raw::c_ulong,
        ) -> my_bool,
    >,
    pub mysql_stmt_result_metadata:
        ::std::option::Option<unsafe extern "C" fn(stmt: *mut MYSQL_STMT) -> *mut MYSQL_RES>,
    pub mysql_stmt_param_metadata:
        ::std::option::Option<unsafe extern "C" fn(stmt: *mut MYSQL_STMT) -> *mut MYSQL_RES>,
    pub mysql_stmt_errno: ::std::option::Option<
        unsafe extern "C" fn(stmt: *mut MYSQL_STMT) -> ::std::os::raw::c_uint,
    >,
    pub mysql_stmt_error: ::std::option::Option<
        unsafe extern "C" fn(stmt: *mut MYSQL_STMT) -> *const ::std::os::raw::c_char,
    >,
    pub mysql_stmt_sqlstate: ::std::option::Option<
        unsafe extern "C" fn(stmt: *mut MYSQL_STMT) -> *const ::std::os::raw::c_char,
    >,
    pub mysql_stmt_row_seek: ::std::option::Option<
        unsafe extern "C" fn(stmt: *mut MYSQL_STMT, offset: MYSQL_ROW_OFFSET) -> MYSQL_ROW_OFFSET,
    >,
    pub mysql_stmt_row_tell:
        ::std::option::Option<unsafe extern "C" fn(stmt: *mut MYSQL_STMT) -> MYSQL_ROW_OFFSET>,
    pub mysql_stmt_data_seek: ::std::option::Option<
        unsafe extern "C" fn(stmt: *mut MYSQL_STMT, offset: ::std::os::raw::c_ulonglong),
    >,
    pub mysql_stmt_num_rows: ::std::option::Option<
        unsafe extern "C" fn(stmt: *mut MYSQL_STMT) -> ::std::os::raw::c_ulonglong,
    >,
    pub mysql_stmt_affected_rows: ::std::option::Option<
        unsafe extern "C" fn(stmt: *mut MYSQL_STMT) -> ::std::os::raw::c_ulonglong,
    >,
    pub mysql_stmt_insert_id: ::std::option::Option<
        unsafe extern "C" fn(stmt: *mut MYSQL_STMT) -> ::std::os::raw::c_ulonglong,
    >,
    pub mysql_stmt_field_count: ::std::option::Option<
        unsafe extern "C" fn(stmt: *mut MYSQL_STMT) -> ::std::os::raw::c_uint,
    >,
    pub mysql_stmt_next_result:
        ::std::option::Option<unsafe extern "C" fn(stmt: *mut MYSQL_STMT) -> ::std::os::raw::c_int>,
    pub mysql_stmt_more_results:
        ::std::option::Option<unsafe extern "C" fn(stmt: *mut MYSQL_STMT) -> my_bool>,
    pub mariadb_stmt_execute_direct: ::std::option::Option<
        unsafe extern "C" fn(
            stmt: *mut MYSQL_STMT,
            stmtstr: *const ::std::os::raw::c_char,
            length: usize,
        ) -> ::std::os::raw::c_int,
    >,
    pub mysql_reset_connection:
        ::std::option::Option<unsafe extern "C" fn(mysql: *mut MYSQL) -> ::std::os::raw::c_int>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of st_mariadb_api"][::std::mem::size_of::<st_mariadb_api>() - 920usize];
    ["Alignment of st_mariadb_api"][::std::mem::align_of::<st_mariadb_api>() - 8usize];
    ["Offset of field: st_mariadb_api::mysql_num_rows"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_num_rows) - 0usize];
    ["Offset of field: st_mariadb_api::mysql_num_fields"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_num_fields) - 8usize];
    ["Offset of field: st_mariadb_api::mysql_eof"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_eof) - 16usize];
    ["Offset of field: st_mariadb_api::mysql_fetch_field_direct"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_fetch_field_direct) - 24usize];
    ["Offset of field: st_mariadb_api::mysql_fetch_fields"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_fetch_fields) - 32usize];
    ["Offset of field: st_mariadb_api::mysql_row_tell"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_row_tell) - 40usize];
    ["Offset of field: st_mariadb_api::mysql_field_tell"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_field_tell) - 48usize];
    ["Offset of field: st_mariadb_api::mysql_field_count"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_field_count) - 56usize];
    ["Offset of field: st_mariadb_api::mysql_more_results"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_more_results) - 64usize];
    ["Offset of field: st_mariadb_api::mysql_next_result"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_next_result) - 72usize];
    ["Offset of field: st_mariadb_api::mysql_affected_rows"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_affected_rows) - 80usize];
    ["Offset of field: st_mariadb_api::mysql_autocommit"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_autocommit) - 88usize];
    ["Offset of field: st_mariadb_api::mysql_commit"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_commit) - 96usize];
    ["Offset of field: st_mariadb_api::mysql_rollback"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_rollback) - 104usize];
    ["Offset of field: st_mariadb_api::mysql_insert_id"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_insert_id) - 112usize];
    ["Offset of field: st_mariadb_api::mysql_errno"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_errno) - 120usize];
    ["Offset of field: st_mariadb_api::mysql_error"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_error) - 128usize];
    ["Offset of field: st_mariadb_api::mysql_info"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_info) - 136usize];
    ["Offset of field: st_mariadb_api::mysql_thread_id"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_thread_id) - 144usize];
    ["Offset of field: st_mariadb_api::mysql_character_set_name"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_character_set_name) - 152usize];
    ["Offset of field: st_mariadb_api::mysql_get_character_set_info"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_get_character_set_info) - 160usize];
    ["Offset of field: st_mariadb_api::mysql_set_character_set"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_set_character_set) - 168usize];
    ["Offset of field: st_mariadb_api::mariadb_get_infov"]
        [::std::mem::offset_of!(st_mariadb_api, mariadb_get_infov) - 176usize];
    ["Offset of field: st_mariadb_api::mariadb_get_info"]
        [::std::mem::offset_of!(st_mariadb_api, mariadb_get_info) - 184usize];
    ["Offset of field: st_mariadb_api::mysql_init"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_init) - 192usize];
    ["Offset of field: st_mariadb_api::mysql_ssl_set"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_ssl_set) - 200usize];
    ["Offset of field: st_mariadb_api::mysql_get_ssl_cipher"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_get_ssl_cipher) - 208usize];
    ["Offset of field: st_mariadb_api::mysql_change_user"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_change_user) - 216usize];
    ["Offset of field: st_mariadb_api::mysql_real_connect"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_real_connect) - 224usize];
    ["Offset of field: st_mariadb_api::mysql_close"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_close) - 232usize];
    ["Offset of field: st_mariadb_api::mysql_select_db"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_select_db) - 240usize];
    ["Offset of field: st_mariadb_api::mysql_query"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_query) - 248usize];
    ["Offset of field: st_mariadb_api::mysql_send_query"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_send_query) - 256usize];
    ["Offset of field: st_mariadb_api::mysql_read_query_result"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_read_query_result) - 264usize];
    ["Offset of field: st_mariadb_api::mysql_real_query"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_real_query) - 272usize];
    ["Offset of field: st_mariadb_api::mysql_shutdown"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_shutdown) - 280usize];
    ["Offset of field: st_mariadb_api::mysql_dump_debug_info"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_dump_debug_info) - 288usize];
    ["Offset of field: st_mariadb_api::mysql_refresh"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_refresh) - 296usize];
    ["Offset of field: st_mariadb_api::mysql_kill"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_kill) - 304usize];
    ["Offset of field: st_mariadb_api::mysql_ping"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_ping) - 312usize];
    ["Offset of field: st_mariadb_api::mysql_stat"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_stat) - 320usize];
    ["Offset of field: st_mariadb_api::mysql_get_server_info"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_get_server_info) - 328usize];
    ["Offset of field: st_mariadb_api::mysql_get_server_version"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_get_server_version) - 336usize];
    ["Offset of field: st_mariadb_api::mysql_get_host_info"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_get_host_info) - 344usize];
    ["Offset of field: st_mariadb_api::mysql_get_proto_info"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_get_proto_info) - 352usize];
    ["Offset of field: st_mariadb_api::mysql_list_dbs"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_list_dbs) - 360usize];
    ["Offset of field: st_mariadb_api::mysql_list_tables"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_list_tables) - 368usize];
    ["Offset of field: st_mariadb_api::mysql_list_fields"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_list_fields) - 376usize];
    ["Offset of field: st_mariadb_api::mysql_list_processes"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_list_processes) - 384usize];
    ["Offset of field: st_mariadb_api::mysql_store_result"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_store_result) - 392usize];
    ["Offset of field: st_mariadb_api::mysql_use_result"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_use_result) - 400usize];
    ["Offset of field: st_mariadb_api::mysql_options"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_options) - 408usize];
    ["Offset of field: st_mariadb_api::mysql_free_result"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_free_result) - 416usize];
    ["Offset of field: st_mariadb_api::mysql_data_seek"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_data_seek) - 424usize];
    ["Offset of field: st_mariadb_api::mysql_row_seek"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_row_seek) - 432usize];
    ["Offset of field: st_mariadb_api::mysql_field_seek"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_field_seek) - 440usize];
    ["Offset of field: st_mariadb_api::mysql_fetch_row"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_fetch_row) - 448usize];
    ["Offset of field: st_mariadb_api::mysql_fetch_lengths"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_fetch_lengths) - 456usize];
    ["Offset of field: st_mariadb_api::mysql_fetch_field"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_fetch_field) - 464usize];
    ["Offset of field: st_mariadb_api::mysql_escape_string"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_escape_string) - 472usize];
    ["Offset of field: st_mariadb_api::mysql_real_escape_string"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_real_escape_string) - 480usize];
    ["Offset of field: st_mariadb_api::mysql_thread_safe"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_thread_safe) - 488usize];
    ["Offset of field: st_mariadb_api::mysql_warning_count"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_warning_count) - 496usize];
    ["Offset of field: st_mariadb_api::mysql_sqlstate"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_sqlstate) - 504usize];
    ["Offset of field: st_mariadb_api::mysql_server_init"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_server_init) - 512usize];
    ["Offset of field: st_mariadb_api::mysql_server_end"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_server_end) - 520usize];
    ["Offset of field: st_mariadb_api::mysql_thread_end"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_thread_end) - 528usize];
    ["Offset of field: st_mariadb_api::mysql_thread_init"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_thread_init) - 536usize];
    ["Offset of field: st_mariadb_api::mysql_set_server_option"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_set_server_option) - 544usize];
    ["Offset of field: st_mariadb_api::mysql_get_client_info"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_get_client_info) - 552usize];
    ["Offset of field: st_mariadb_api::mysql_get_client_version"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_get_client_version) - 560usize];
    ["Offset of field: st_mariadb_api::mariadb_connection"]
        [::std::mem::offset_of!(st_mariadb_api, mariadb_connection) - 568usize];
    ["Offset of field: st_mariadb_api::mysql_get_server_name"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_get_server_name) - 576usize];
    ["Offset of field: st_mariadb_api::mariadb_get_charset_by_name"]
        [::std::mem::offset_of!(st_mariadb_api, mariadb_get_charset_by_name) - 584usize];
    ["Offset of field: st_mariadb_api::mariadb_get_charset_by_nr"]
        [::std::mem::offset_of!(st_mariadb_api, mariadb_get_charset_by_nr) - 592usize];
    ["Offset of field: st_mariadb_api::mariadb_convert_string"]
        [::std::mem::offset_of!(st_mariadb_api, mariadb_convert_string) - 600usize];
    ["Offset of field: st_mariadb_api::mysql_optionsv"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_optionsv) - 608usize];
    ["Offset of field: st_mariadb_api::mysql_get_optionv"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_get_optionv) - 616usize];
    ["Offset of field: st_mariadb_api::mysql_get_option"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_get_option) - 624usize];
    ["Offset of field: st_mariadb_api::mysql_hex_string"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_hex_string) - 632usize];
    ["Offset of field: st_mariadb_api::mysql_get_socket"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_get_socket) - 640usize];
    ["Offset of field: st_mariadb_api::mysql_get_timeout_value"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_get_timeout_value) - 648usize];
    ["Offset of field: st_mariadb_api::mysql_get_timeout_value_ms"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_get_timeout_value_ms) - 656usize];
    ["Offset of field: st_mariadb_api::mariadb_reconnect"]
        [::std::mem::offset_of!(st_mariadb_api, mariadb_reconnect) - 664usize];
    ["Offset of field: st_mariadb_api::mysql_stmt_init"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_stmt_init) - 672usize];
    ["Offset of field: st_mariadb_api::mysql_stmt_prepare"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_stmt_prepare) - 680usize];
    ["Offset of field: st_mariadb_api::mysql_stmt_execute"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_stmt_execute) - 688usize];
    ["Offset of field: st_mariadb_api::mysql_stmt_fetch"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_stmt_fetch) - 696usize];
    ["Offset of field: st_mariadb_api::mysql_stmt_fetch_column"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_stmt_fetch_column) - 704usize];
    ["Offset of field: st_mariadb_api::mysql_stmt_store_result"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_stmt_store_result) - 712usize];
    ["Offset of field: st_mariadb_api::mysql_stmt_param_count"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_stmt_param_count) - 720usize];
    ["Offset of field: st_mariadb_api::mysql_stmt_attr_set"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_stmt_attr_set) - 728usize];
    ["Offset of field: st_mariadb_api::mysql_stmt_attr_get"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_stmt_attr_get) - 736usize];
    ["Offset of field: st_mariadb_api::mysql_stmt_bind_param"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_stmt_bind_param) - 744usize];
    ["Offset of field: st_mariadb_api::mysql_stmt_bind_result"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_stmt_bind_result) - 752usize];
    ["Offset of field: st_mariadb_api::mysql_stmt_close"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_stmt_close) - 760usize];
    ["Offset of field: st_mariadb_api::mysql_stmt_reset"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_stmt_reset) - 768usize];
    ["Offset of field: st_mariadb_api::mysql_stmt_free_result"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_stmt_free_result) - 776usize];
    ["Offset of field: st_mariadb_api::mysql_stmt_send_long_data"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_stmt_send_long_data) - 784usize];
    ["Offset of field: st_mariadb_api::mysql_stmt_result_metadata"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_stmt_result_metadata) - 792usize];
    ["Offset of field: st_mariadb_api::mysql_stmt_param_metadata"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_stmt_param_metadata) - 800usize];
    ["Offset of field: st_mariadb_api::mysql_stmt_errno"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_stmt_errno) - 808usize];
    ["Offset of field: st_mariadb_api::mysql_stmt_error"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_stmt_error) - 816usize];
    ["Offset of field: st_mariadb_api::mysql_stmt_sqlstate"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_stmt_sqlstate) - 824usize];
    ["Offset of field: st_mariadb_api::mysql_stmt_row_seek"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_stmt_row_seek) - 832usize];
    ["Offset of field: st_mariadb_api::mysql_stmt_row_tell"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_stmt_row_tell) - 840usize];
    ["Offset of field: st_mariadb_api::mysql_stmt_data_seek"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_stmt_data_seek) - 848usize];
    ["Offset of field: st_mariadb_api::mysql_stmt_num_rows"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_stmt_num_rows) - 856usize];
    ["Offset of field: st_mariadb_api::mysql_stmt_affected_rows"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_stmt_affected_rows) - 864usize];
    ["Offset of field: st_mariadb_api::mysql_stmt_insert_id"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_stmt_insert_id) - 872usize];
    ["Offset of field: st_mariadb_api::mysql_stmt_field_count"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_stmt_field_count) - 880usize];
    ["Offset of field: st_mariadb_api::mysql_stmt_next_result"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_stmt_next_result) - 888usize];
    ["Offset of field: st_mariadb_api::mysql_stmt_more_results"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_stmt_more_results) - 896usize];
    ["Offset of field: st_mariadb_api::mariadb_stmt_execute_direct"]
        [::std::mem::offset_of!(st_mariadb_api, mariadb_stmt_execute_direct) - 904usize];
    ["Offset of field: st_mariadb_api::mysql_reset_connection"]
        [::std::mem::offset_of!(st_mariadb_api, mysql_reset_connection) - 912usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct st_mariadb_methods {
    pub db_connect: ::std::option::Option<
        unsafe extern "C" fn(
            mysql: *mut MYSQL,
            host: *const ::std::os::raw::c_char,
            user: *const ::std::os::raw::c_char,
            passwd: *const ::std::os::raw::c_char,
            db: *const ::std::os::raw::c_char,
            port: ::std::os::raw::c_uint,
            unix_socket: *const ::std::os::raw::c_char,
            clientflag: ::std::os::raw::c_ulong,
        ) -> *mut MYSQL,
    >,
    pub db_close: ::std::option::Option<unsafe extern "C" fn(mysql: *mut MYSQL)>,
    pub db_command: ::std::option::Option<
        unsafe extern "C" fn(
            mysql: *mut MYSQL,
            command: enum_server_command,
            arg: *const ::std::os::raw::c_char,
            length: usize,
            skip_check: my_bool,
            opt_arg: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >,
    pub db_skip_result: ::std::option::Option<unsafe extern "C" fn(mysql: *mut MYSQL)>,
    pub db_read_query_result:
        ::std::option::Option<unsafe extern "C" fn(mysql: *mut MYSQL) -> ::std::os::raw::c_int>,
    pub db_read_rows: ::std::option::Option<
        unsafe extern "C" fn(
            mysql: *mut MYSQL,
            fields: *mut MYSQL_FIELD,
            field_count: ::std::os::raw::c_uint,
        ) -> *mut MYSQL_DATA,
    >,
    pub db_read_one_row: ::std::option::Option<
        unsafe extern "C" fn(
            mysql: *mut MYSQL,
            fields: ::std::os::raw::c_uint,
            row: MYSQL_ROW,
            lengths: *mut ::std::os::raw::c_ulong,
        ) -> ::std::os::raw::c_int,
    >,
    pub db_supported_buffer_type:
        ::std::option::Option<unsafe extern "C" fn(type_: enum_field_types) -> my_bool>,
    pub db_read_prepare_response:
        ::std::option::Option<unsafe extern "C" fn(stmt: *mut MYSQL_STMT) -> my_bool>,
    pub db_read_stmt_result:
        ::std::option::Option<unsafe extern "C" fn(mysql: *mut MYSQL) -> ::std::os::raw::c_int>,
    pub db_stmt_get_result_metadata:
        ::std::option::Option<unsafe extern "C" fn(stmt: *mut MYSQL_STMT) -> my_bool>,
    pub db_stmt_get_param_metadata:
        ::std::option::Option<unsafe extern "C" fn(stmt: *mut MYSQL_STMT) -> my_bool>,
    pub db_stmt_read_all_rows:
        ::std::option::Option<unsafe extern "C" fn(stmt: *mut MYSQL_STMT) -> ::std::os::raw::c_int>,
    pub db_stmt_fetch: ::std::option::Option<
        unsafe extern "C" fn(
            stmt: *mut MYSQL_STMT,
            row: *mut *mut ::std::os::raw::c_uchar,
        ) -> ::std::os::raw::c_int,
    >,
    pub db_stmt_fetch_to_bind: ::std::option::Option<
        unsafe extern "C" fn(
            stmt: *mut MYSQL_STMT,
            row: *mut ::std::os::raw::c_uchar,
        ) -> ::std::os::raw::c_int,
    >,
    pub db_stmt_flush_unbuffered:
        ::std::option::Option<unsafe extern "C" fn(stmt: *mut MYSQL_STMT)>,
    pub set_error: ::std::option::Option<
        unsafe extern "C" fn(
            mysql: *mut MYSQL,
            error_nr: ::std::os::raw::c_uint,
            sqlstate: *const ::std::os::raw::c_char,
            format: *const ::std::os::raw::c_char,
            ...
        ),
    >,
    pub invalidate_stmts: ::std::option::Option<
        unsafe extern "C" fn(mysql: *mut MYSQL, function_name: *const ::std::os::raw::c_char),
    >,
    pub api: *mut st_mariadb_api,
    pub db_read_execute_response:
        ::std::option::Option<unsafe extern "C" fn(stmt: *mut MYSQL_STMT) -> ::std::os::raw::c_int>,
    pub db_execute_generate_request: ::std::option::Option<
        unsafe extern "C" fn(
            stmt: *mut MYSQL_STMT,
            request_len: *mut usize,
            internal: my_bool,
        ) -> *mut ::std::os::raw::c_uchar,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of st_mariadb_methods"][::std::mem::size_of::<st_mariadb_methods>() - 168usize];
    ["Alignment of st_mariadb_methods"][::std::mem::align_of::<st_mariadb_methods>() - 8usize];
    ["Offset of field: st_mariadb_methods::db_connect"]
        [::std::mem::offset_of!(st_mariadb_methods, db_connect) - 0usize];
    ["Offset of field: st_mariadb_methods::db_close"]
        [::std::mem::offset_of!(st_mariadb_methods, db_close) - 8usize];
    ["Offset of field: st_mariadb_methods::db_command"]
        [::std::mem::offset_of!(st_mariadb_methods, db_command) - 16usize];
    ["Offset of field: st_mariadb_methods::db_skip_result"]
        [::std::mem::offset_of!(st_mariadb_methods, db_skip_result) - 24usize];
    ["Offset of field: st_mariadb_methods::db_read_query_result"]
        [::std::mem::offset_of!(st_mariadb_methods, db_read_query_result) - 32usize];
    ["Offset of field: st_mariadb_methods::db_read_rows"]
        [::std::mem::offset_of!(st_mariadb_methods, db_read_rows) - 40usize];
    ["Offset of field: st_mariadb_methods::db_read_one_row"]
        [::std::mem::offset_of!(st_mariadb_methods, db_read_one_row) - 48usize];
    ["Offset of field: st_mariadb_methods::db_supported_buffer_type"]
        [::std::mem::offset_of!(st_mariadb_methods, db_supported_buffer_type) - 56usize];
    ["Offset of field: st_mariadb_methods::db_read_prepare_response"]
        [::std::mem::offset_of!(st_mariadb_methods, db_read_prepare_response) - 64usize];
    ["Offset of field: st_mariadb_methods::db_read_stmt_result"]
        [::std::mem::offset_of!(st_mariadb_methods, db_read_stmt_result) - 72usize];
    ["Offset of field: st_mariadb_methods::db_stmt_get_result_metadata"]
        [::std::mem::offset_of!(st_mariadb_methods, db_stmt_get_result_metadata) - 80usize];
    ["Offset of field: st_mariadb_methods::db_stmt_get_param_metadata"]
        [::std::mem::offset_of!(st_mariadb_methods, db_stmt_get_param_metadata) - 88usize];
    ["Offset of field: st_mariadb_methods::db_stmt_read_all_rows"]
        [::std::mem::offset_of!(st_mariadb_methods, db_stmt_read_all_rows) - 96usize];
    ["Offset of field: st_mariadb_methods::db_stmt_fetch"]
        [::std::mem::offset_of!(st_mariadb_methods, db_stmt_fetch) - 104usize];
    ["Offset of field: st_mariadb_methods::db_stmt_fetch_to_bind"]
        [::std::mem::offset_of!(st_mariadb_methods, db_stmt_fetch_to_bind) - 112usize];
    ["Offset of field: st_mariadb_methods::db_stmt_flush_unbuffered"]
        [::std::mem::offset_of!(st_mariadb_methods, db_stmt_flush_unbuffered) - 120usize];
    ["Offset of field: st_mariadb_methods::set_error"]
        [::std::mem::offset_of!(st_mariadb_methods, set_error) - 128usize];
    ["Offset of field: st_mariadb_methods::invalidate_stmts"]
        [::std::mem::offset_of!(st_mariadb_methods, invalidate_stmts) - 136usize];
    ["Offset of field: st_mariadb_methods::api"]
        [::std::mem::offset_of!(st_mariadb_methods, api) - 144usize];
    ["Offset of field: st_mariadb_methods::db_read_execute_response"]
        [::std::mem::offset_of!(st_mariadb_methods, db_read_execute_response) - 152usize];
    ["Offset of field: st_mariadb_methods::db_execute_generate_request"]
        [::std::mem::offset_of!(st_mariadb_methods, db_execute_generate_request) - 160usize];
};
pub type __builtin_va_list = [__va_list_tag; 1usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __va_list_tag {
    pub gp_offset: ::std::os::raw::c_uint,
    pub fp_offset: ::std::os::raw::c_uint,
    pub overflow_arg_area: *mut ::std::os::raw::c_void,
    pub reg_save_area: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __va_list_tag"][::std::mem::size_of::<__va_list_tag>() - 24usize];
    ["Alignment of __va_list_tag"][::std::mem::align_of::<__va_list_tag>() - 8usize];
    ["Offset of field: __va_list_tag::gp_offset"]
        [::std::mem::offset_of!(__va_list_tag, gp_offset) - 0usize];
    ["Offset of field: __va_list_tag::fp_offset"]
        [::std::mem::offset_of!(__va_list_tag, fp_offset) - 4usize];
    ["Offset of field: __va_list_tag::overflow_arg_area"]
        [::std::mem::offset_of!(__va_list_tag, overflow_arg_area) - 8usize];
    ["Offset of field: __va_list_tag::reg_save_area"]
        [::std::mem::offset_of!(__va_list_tag, reg_save_area) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_data {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct st_mariadb_net_extension {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct st_dynamic_array {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct st_mysql_options_extension {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct st_mariadb_extension {
    pub _address: u8,
}
